[
  {
    "Content": "<quote>\n<p class=\"quote\">“Nothing is too wonderful to be true, if it be consistent with the laws of nature”</p>\n<p class=\"quote-author\">— Michael Faraday</p>\n</quote>\n    <br>  \n    <p>The Earth moves around the Sun at a speed of about 100.000 Km/h, which is approximately 30.000 meters each second.</p>\n    <br>\n    <p>Just for context, the fastest vehicle in the world, which is an aircraft called NASA X-43, can reach a speed of about 12.000 Km/h. That’s barely 10% of the earth's speed around the sun.</p>\n    <br>\n    <p>Motion is present in everything we do, and it goes way beyond walking, driving, and flying, motion can be used to describe the orbit of a planet and even the orbit of an electron around the core of an atom.</p>\n    <br>\n    <p>Motion also takes many forms and shapes.</p>\n    <br>\n    <p>We have <strong>oscillatory motion</strong>, referring to the motion of particles that go back and forth repeatedly.</p>\n    <br>\n    <p>We also have at our disposal periodic motion, which can be used to describe the motion of planets and every motion that repeats itself after some time interval.</p>\n    <br>\n    <p><strong>Random motion</strong> is one of the most interesting types of motion since we currently don't have ways of predicting the motion of an object.</p>\n    <br>\n    <p>Imagine a paper being dropped from any height, we won't be able to come up with an equation that will describe the path of the paper.</p>\n    <br>\n    <p>But since we are only talking about motion in one dimension we are going to leave those subjects for future learning since the topics wander beyond our current scope.</p>\n    <br>\n    <p>Today we have a solid understanding of pretty much all the laws of motion.</p>\n    <br>\n    <p>But it wasn't always like this.</p>\n    <br>\n    <p><strong>“In the absence of air resistance, all bodies fall with the same acceleration, independent of their mass”.</strong></p>\n    <br>\n    <p>This is the famous quote representing the theory of Galileo regarding the free-falling of objects.</p>\n    <br>\n    <p>Although Galileo could not see his experiment in action because of the technological limitations of his time, his theory proved to be right many years later.</p>\n    <br>\n    <p>Newton also contributed a great deal to motion with his <a href='https://joaovitorwitt.com/articles/10' target='_blank' rel='noreferrer' class='newpage-link'>laws.</a></p>\n    <br>\n    <p>Perhaps it is safe to say that today we rest on the shoulders of giants.</p>\n    <br>\n    <p>And it's our duty as a civilization to continue to thrive for more and more understanding of our universe and life.</p>\n    <br>\n    <p>And what better way to start this than by comprehending all the basic foundations of kinematics?</p>\n    <br>\n    <h3>Displacement</h3>\n    <br>\n    <p>Displacement can be defined as the difference in position regarding the initial position where the object started.</p>\n    <br>\n    <p>But before going even deeper into understanding displacement, we must always have a frame of reference in our minds, because this will help us practically illustrate the problem.</p>\n    <br>\n    <p>As I mentioned, a frame of reference is simply an easy way to locate the position of an object relative to a reference point.</p>\n    <br>\n    <p>As humans, we can always visualize the problem in our heads, but in physics, it is really common to use a set of coordinate axes.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323153/Kinematics-Article-Images/l57iit8p4yypn014aqpy.png' alt='Coordinate Axis'/>\n    <br>\n    <p>In most cases, when we are describing a person walking either east or west we tend to use the x-axis. On the other hand, when we are illustrating some object falling we use the y-axis.</p>\n    <br>\n    <p>So we can define <strong>displacement</strong> as the difference between the final and the initial position of an object.</p>\n    <br>\n    <p>Mathematically, we can represent this with the following formula:</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323154/Kinematics-Article-Images/vgocdrbddjq15xmm5nhq.png' alt='Displacement Formula' />\n    <br>\n    <p>Where x2 refers to the final position, and x1 refers to the initial position</p>\n    <br>\n    <p>Let’s understand this further with an example:</p>\n    <br>\n    <p>A person drives 10 km east from his starting point, then 5 km west.</p>\n    <br>\n    <p>Based on our definitions of displacement, it is safe to say that the displacement is 5 km since the person ended 5 kilometers away from the initial position.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323154/Kinematics-Article-Images/w1pph2ci3n7aiigzvfao.png' alt='Displacement Example' />\n    <br>\n    <p>Let's verify this further by plugging the values directly into the formula.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323154/Kinematics-Article-Images/mrk2wexjgbtk1yxp455b.png' alt='Displacement Calculation' />\n    <br>\n    <p>It is also important to point out that <strong>displacement</strong> differs from the <strong>total distance</strong> traveled.</p>\n    <br>\n    <p>As the name suggests, the total distance refers to the entire path covered by the object, and displacement is how far the object is from its origin point.</p>\n    <br>\n    <p>Based on our example, the total distance covered by the person driving the car is 15 km.</p>\n    <br>\n    <p>Now that we understand what displacement is, you might be wondering how we go about solving actual problems.</p>\n    <br>\n    <p>Well, let's do this.</p>\n    <br>\n    <p><strong>Imagine a dog starting at x = 25 m on a coordinate space and after walking along the x-axis he ends up on x = -15 m. It then turns around and walks back again ending up on x = 5 m. Determine the dog’s displacement and the total distance traveled by the dog.</strong></p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323154/Kinematics-Article-Images/wwt3nsequt0gtl1e2cyo.png' alt='Displacement Problem Example' />\n    <br>\n    <h3>Average Velocity</h3>\n    <br>\n    <p>Motion is a huge part of physics, back in the 1500s and 1600s big names like Isaac Newton and Galileo Galilei were laying the foundation for our understanding of motion.</p>\n    <br>\n    <p>As we know motion is directly tied to our lives, almost everything we do revolves around motion, walking, driving, running, you name it.</p>\n    <br>\n    <p>Consequently, motion and velocity work together just like hammer and nail.</p>\n    <br>\n    <p>In our everyday lives, the terms velocity and speed are often used as the same thing.</p>\n    <br>\n    <p>But when we are trying to comprehend the laws of physics we must make a distinction between velocity and speed.</p>\n    <br>\n    <p><strong/>Velocity</strong> refers to the <strong>displacement</strong> of an object divided by the elapsed time. We already know that displacement is the difference between the final and initial position of an object.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323154/Kinematics-Article-Images/tbijbh83wmkj4h5zpcmj.png' alt='Average Velocity Formula' />\n    <br>\n    <p>On the other hand, <strong>speed</strong> or average speed can be defined as the total distance traveled by an object divided by the total time. If a truck travels 250 km in 5 hours we can say that the average speed of the truck is 50 km/h.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323153/Kinematics-Article-Images/pnznrwrcia0rtgfeicvn.png' alt='Average Speed Formula' />\n    <br>\n    <p>Let's go a little deeper with our same dog example.</p>\n    <br>\n    <p><strong>The dog started on x = 25 m, then he walked along the horizontal axis and ended up on x = -15 m, finally the dog circles around and stopped on x = 5 m. Imagine that the total time was 20 seconds.</strong></p>\n    <br>\n    <p>Let's start with the average speed.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323154/Kinematics-Article-Images/otyk11tpbdcseyvr5zqo.png' alt='Average Speed Problem' />\n    <br>\n    <p>We know first that the dog started on x = 25 m and went to x = -15 m, which gives us <strong>40 m</strong> walked.</p>\n    <br>\n    <p>Then from x = -15 m, he went back to x = 5 m, which gives us <strong>20 m.</strong></p>\n    <br>\n    <p>Adding 40 m to 20 m gives us <strong>60 m.</strong></p>\n    <br>\n    <p>Applying the average speed formula, we can figure out that the average speed of the dog is <strong>3 m/s.</strong></p>\n    <br>\n    <p>Since we are talking about the average speed we don't need to worry about the negative signs because we only care about the total distance covered by the dog.</p>\n    <br>\n    <p>But now this changes a bit when calculating the <strong>average velocity.</strong></p>\n    <br>\n    <p>We know for certain that the dog started on x = 25 m (initial position) and ended up on x = 5 m (final position).</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323153/Kinematics-Article-Images/xyzgcfn2didogb3ibioa.png' alt='Average Velocity Problem' />\n    <br>\n    <p>In this context, we only need to worry about the final position relative to the origin point.</p>\n    <br>\n    <p>Applying the average velocity formula we get:</p>\n    <br>\n    <p>Displacement = 5 m - 25 m = <strong>-20 m</strong></p>\n    <br>\n    <p>Dividing our displacement by the total time the dog took we get our average velocity of <strong>-1 m/s.</strong></p>\n    <br>\n    <p>The answer is negative because according to our frame of reference, the dog walked back in the negative direction.</p>\n    <br>\n    <h3>Acceleration</h3>\n    <br>\n    <p>Now that we understand the laws of velocity we can start to look at acceleration since it is directly tied to velocity.</p>\n    <br>\n    <p>An object is said to be accelerating whenever a change in velocity occurs</p>\n    <br>\n    <p>Putting in more formal terms, acceleration can be defined as the <strong>change in velocity</strong> divided by a <strong>time interval.</strong></p>\n    <br>\n    <p>This means that when we say an object has an acceleration 5 m/s2 we are basically saying the object accelerates 5 m/s each second. That also explains why the second unit is squared on acceleration.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323153/Kinematics-Article-Images/zopi8yfg1yzyajgtmng8.png' alt='Average Acceleration Formula' />\n    <br>\n    <p>We can represent more precisely this relationship between the velocity and time in this formula:</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/qthhq0rdqfoutz072q1o.png' alt='Average Acceleration Formula' />\n    <br>\n    <p>There will be times when physics problems will involve a bunch of terms like velocity, position, time, and acceleration.</p>\n    <br>\n    <p>It is important to point out that we are talking about <strong>constant acceleration</strong>, in other words, the change in velocity stays the same. If we say that a particle has an acceleration of 5 m/s2 this acceleration will be the same throughout the entire motion.</p>\n    <br>\n    <p>So for that, we will need to find useful equations that will allow us to solve any problem related to constant acceleration.</p>\n    <br>\n    <p>In most kinematics problems related to motion, we want to find the velocity after a given time. For instance, we might want to know the velocity of a car after 15 seconds.</p>\n    <br>\n    <p>To achieve that we can simply grab our previous acceleration equation and solve for “v” giving us:</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323154/Kinematics-Article-Images/ewnzxvtn5tucjpchpvep.png' alt='First Kinematics Equation' />\n    <br>\n    <p>Sometimes we might also want to know the <strong>position</strong> of an object after a given time. </p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/hl9ipmbevhb1rwrvpgfx.png' alt='Second Kinematics Equation' />\n    <br>\n    <p>Now you might be wondering the situations in which time is not known or we do not care about the time. Well for that we have this one:</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/qjp19xap9lkkzsjqoddr.png' alt='Third Kinematics Equation' />\n    <br>\n    <p>All three formulas above relate velocity, acceleration, position, and time.</p>\n    <br>\n    <p>At this point in our learning, you have all the building blocks necessary to solve any kinematics problem that appears in your way.</p> \n    <br>\n    <p>For reference, below there are all the useful kinematics equations for constant acceleration.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/y9fbcp7klksbm6yueaid.png' alt='Kinematics Formulas' />\n    <br>\n    <h3>Freefall objects</h3>\n    <br>\n    <p>This happened many years before Galileo’s time.</p>\n    <br>\n    <p>Just like people believed that the Sun orbits the Earth.</p>\n    <br>\n    <p>People also used to believe that heavier objects fall faster than lighter objects because of their mass.</p> \n    <br>\n    <p>But now we can safely conclude that the <strong>speed of a falling object is not proportional to its mass.</strong></p>\n    <br>\n    <p>Galileo idealized a scenario in which, in the absence of air resistance all the objects would fall at the same speed.</p>\n    <br>\n    <p>If I said that objects will float because angels hold them, then I will need to develop ways of testing my theory.</p>\n    <br>\n    <p>In the scientific world, a theory that cannot be tested is considered less scientific because it lacks empirical evidence.</p>\n    <br>\n    <p>Although Galileo had some technological limitations for his time, he knew that.</p>\n    <br>\n    <p>That's why he idealized a scenario in which, in the absence of air resistance all the objects would fall at the same speed.</p>\n    <br>\n    <p>It is nice when a theory can be tested, so to support his ideas he used the following demonstration and argument:</p>\n    <br>\n    <p>A rock dropped from a height of 2 meters will have a larger impact on the ground than the same rock dropped from a height of 0.3 meters, for that to happen the first rock must be at a higher speed.</p>\n    <br>\n    <p>As I mentioned before, Galileo developed an experiment where we put a rock and a feather on a tube.</p>\n    <br>\n    <p>For the first scenario the tube is filled with air then the rock and the feather are dropped at the same time, and the rock obviously hits the ground first.</p>\n    <br>\n    <p>But this changes in the next experiment.</p>\n    <br>\n    <p>Interestingly enough, when we remove all the air from the tube, after releasing the rock and the feather at the same time we confirm that both objects fall at the same speed.</p>\n    <br>\n    <p>Hitting the floor at the same time.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/gxtskkapmb3qxguqlb51.png' alt='Galileo Experiment' />\n    <br>\n    <p>You can check the real experiment by clicking here [insert link here]</p>\n    <br>\n    <p>At this point in our learning, we are forgetting the most important aspect.</p>\n    <br>\n    <p>What is this “speed” that makes all objects fall towards the center of Earth?</p>\n    <br>\n    <p>Well, my friend, this acceleration is caused by Gravity.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/vk9tyiqgzwmfbjpcayvd.png' alt='Gravity Value' />\n    <br>\n    <p>Gravity is present in many topics in physics, it's basically the foundation of our universe, and it's extremely unlikely that we are going to fully understand or solve it anytime soon. Because of that, I will create a separate article in the near future.</p>\n    <br>\n    <p>For now, you just need to know that when we drop an object, the force of gravity makes the object accelerate at a rate of 9.8 m/s2 towards the center of Earth.</p>\n    <br>\n    <p>The million-dollar question now is:</p>\n    <br>\n    <p>Can we use our kinematics formulas from before to solve free-falling problems?</p>\n    <br>\n    <p>Well, dear reader, the answer is YES!</p>\n    <br>\n    <p>Let's solve one right now.</p>\n    <br>\n    <p><strong>A person throws a ball upward with an initial velocity of 20 m/s. Calculate how high it goes.</strong></p>\n    <br>\n    <p>Right from the start this problem tells us two things:</p>\n    <br>\n    <p>— The first one is that it wants to know the <strong>position.</strong></p>\n    <br>\n    <p>— The second is the <strong>initial velocity</strong> of the ball right when it leaves the person’s hand.</p>\n    <br>\n    <p>Equipped with this knowledge, we can now draw a diagram illustrating the problem.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/srqhrulopr0jloyw5djn.png' alt='Free fall Problem Illustration' />\n    <br>\n    <p>Point A is where the ball leaves the person's hand with an initial velocity of 20 meters per second.</p>\n    <br>\n    <p>Between point A and point B, we have a downward acceleration caused by gravity which makes the speed of the ball decrease.</p>\n    <br>\n    <p>Since gravity is pulling downward we will have a negative value for our acceleration.</p>\n    <br>\n    <p>The problem is asking us to calculate the maximum height of the ball. </p>\n    <br>\n    <p>We only worry about the A and B intervals.</p>\n    <br>\n    <p>We consider the acceleration caused by gravity negative because is pointing downwards.</p>\n    <br>\n    <p>$$ { a = -g = -9.8 \\, \\text{m/s}^2 } $$</p>\n    <br>\n    <p>As the ball goes up, its speed decreases until it reaches the highest point where the speed is zero.</p>\n    <br>\n    <p>So now we possess the current quantities:</p>\n    <br>\n    <p>$$ { a = -9.8 \\, \\text{m/s}^2} $$</p>\n    <br>\n    <p>$$ { V_0 = 20 \\, \\text{m/s}} $$</p>\n    <br>\n    <p>$$ { V = 20 \\, \\text{m/s}} $$</p>\n    <br>\n    <p>With only those quantities we can pick the equation that best fits our current problem that we are solving.</p>\n    <br>\n    <img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1704323155/Kinematics-Article-Images/se1w5j1rhi3efozpms6s.png' alt='Solving Free fall Problem' />\n    <br>\n    <h3>How to solve physics problems</h3>\n    <br>\n    <p>Whether you are meaning to pass your next exam or trying to master the field of physics, learning how to solve problems in the most efficient way is crucial for any physics student.</p>\n    <br>\n    <p>For a long time, I thought that solving a physics problem was about finding the right equation to insert the values. Perhaps at the end of the day, this is not wrong, but it can surely lead you to the wrong path if your goal is to understand physics.</p>\n    <br>\n    <p>I noticed my perception of solving problems was completely out of place, I was finding the right answers but I would never understand why I was using a given formula or why certain steps were taken.</p>\n    <br>\n    <p>An equation is just really a way of numerically representing a correct approximation of a problem, the goal of the equation is not to make you understand physics</p>\n    <br>\n    <p>Instead of trying to find some equation to fill in the values, we need to change our perception of looking at physics problems and instead develop an approach that will make us not only find the correct answer but also understand the core ideas and concepts of the problem.</p>\n    <br>\n    <h3>1) Understand the problem</h3>\n    <br>\n    <p>Before trying any problem we must first understand, and that goes for all areas of life.</p>\n    <br>\n    <p>You won't be able to navigate through a problem without understanding it first. For this first part, I recommend that you read carefully the problem and write down what the problem is asking.</p>\n    <br>\n    <p>If a problem asks “How long does it take?”, you know the final answer should be in time units, or  “How far an object will be?”, the answer will be in length units.</p>\n    <br>\n    <p>You should be familiar with these terms.</p>\n    <br>\n    <h3>2) Illustrate the problem in any way possible</h3>\n    <br>\n    <p>Our brains process visual information better than text, especially when solving a physics question. Draw a chart, diagram, graph, or any visual aid that will help you solidify the concepts.</p>\n    <br>\n    <p>It doesn't need to be scientifically correct as long as you understand.</p>\n    <br>\n    <h3>3) Gather all the given quantities</h3>\n    <br>\n    <p>Go through the problem again and take notes of the values given.</p>\n    <br>\n    <p>After that, you will need to interpret the values, as well as what the problem is asking, to write them into physical form. </p>\n    <br>\n    <p>For instance, when a velocity problem states “an object starts from rest” this means that the initial velocity is 0.</p>\n    <br>\n    <p>Based on the given quantities you will hopefully have some idea of what approach to take for solving the problem.</p>\n    <br>\n    <h3>4) Plan an approach</h3>\n    <br>\n    <p>This is the section in which you will know what the problem wants and the principles involved and with that, you will be able to pick an equation or a method that suits the best.</p>\n    <br>\n    <h3>5) Carry out the calculations</h3>\n    <br>\n    <p>If you followed all the steps above correctly, this is the easiest part. Simply plug the quantities into the formula and solve algebraically for the desired value.</p>\n    <br>\n    <p>After you are done, give some thought to the final result and ask yourself: Does this final result make sense? Are the units correct? Is there any way in which I can verify my result?</p>\n    <br>\n    <p>At the end of the day, all this work you’ve done to solve the problem will pay out, not only for your understanding but also for explaining your thought process to a teacher or classmate.</p>\n    <br>\n    <h3>Wrapping Up</h3>\n    <br>\n    <p>As I said at the beginning of our journey, nowadays we rest on the shoulders of giants, and it's our duty to complete the work they started and push beyond the limits.</p>\n    <br>\n    <p>See you next time!</p>\n    <br>",
    "Description": "Motion is one of the most important foundations when it comes to understanding physics and our reality. Most of the time it is the starting point for every student.",
    "Title": "Kinematics In One Dimension",
    "UUID": "f8ee6ed7570f4fc1b04a15e36aa7b2b6",
    "created_at": "20241012 T19:52:39",
    "date": "October 12, 2024",
    "id": 1,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322237/article-images/knjrouxjcjhxrfox8ej4.png",
    "tags": "physics",
    "url_title": "kinematics-in-one-dimension"
  },
  {
    "Content": "<quote>\n<p class=\"quote\">\"Physics is really nothing more than a search for ultimate simplicity, but so far all we have is a kind of elegant messiness.\"</p>\n<p class=\"quote-author\">— Bill Bryson</p>\n</quote>\n<br>\n<p>Whenever we mention human evolution we tend to imagine humans as a multi-planetary species or a dystopian future like Blade Runner governed by AI robots with flying cars.</p>\n<br>\n<p>But we do not need to go that deep to talk about this matter, sometimes simple things like counting objects or measuring the length of a bar already make a huge difference in the grand scheme of things.</p>\n<br>\n<p>Human evolution, specifically in the field of agriculture, brought the necessity of measuring and counting things.</p>\n<br>\n<p>This is when people first started seeing the need for something that once didn't exist.</p>\n<br>\n<p>In the course of human history, there were a lot of measurement systems depending on the culture, each system adapted to its own necessities.</p>\n<br>\n<p>There was the Chinese system, Egyptian system, Roman system, you get the point.</p>\n<br>\n<p>But they all had one goal in mind, measure or count something.</p>\n<br>\n<p>In physics, or any other science, the goal is to understand the chaos and hidden layers around us through observations and careful measurement.</p>\n<br>\n<p>Physics can be described as a creative field, to prove new theories and increase our understanding of the world we must have room to experiment.</p>\n<br>\n<p>Every theory that we have, came from imagination. Take for instance the atomic theory, which states that every element in the universe is composed of tiny little dots called atoms.</p>\n<br>\n<p>Scientists did not come up with this theory by observing atoms, since we can't see them, in fact, this theory was the pure consequence of creative thoughts.</p>\n<br>\n<p>This is one of the reasons why physics is considered a creative field.</p>\n<br>\n<p>Along with those experiments, also comes the need for rules about how things are measured.</p>\n<br>\n<p>Much later, as technology was starting to evolve, accuracy and precision became even more necessary,  so humans needed to figure out a way to standardize how things were measured.</p>\n<br>\n<p>That's when the International System of Units comes into play.</p>\n<br>\n<h3>The International System Of Units</h3>\n<br>\n<p>Today, every country that you visit has a different currency, Dollar, Euro, Indian Ruppe, and so on.</p>\n<br>\n<p>Now imagine if every country that you visited had different units for measuring. That was the deal back in the day.</p>\n<br>\n<p>One country has a different unit for length, another country has a different unit for measuring mass, you get the idea.</p>\n<br>\n<p>You don't need me to tell you that this can get confusing very quickly.</p>\n<br>\n<p>In the 70s the General Conference on Weights and Measures decided to establish a comprehensive specification for units of measurement.</p>\n<br>\n<p>Picking seven quantities as base quantities, forming the new SI.</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/syjnfnbdwekwbenykiqo.png' alt='SI Base Units'>\n<br>\n<p>As technology was getting advanced and humankind had already landed on the moon, they needed a practical way to deal with units and measurements.</p>\n<br>\n<p>And this practical way came in the form of something that was developed more than 1500 years ago by a man called Archimedes.</p>\n<br>\n<h3>Scientific Notation</h3>\n<br>\n<p>Do you wish to represent the distance between two galaxies?</p>\n<br>\n<p>Use scientific notation</p>\n<br>\n<p>Do you want to represent the radius of a proton?</p>\n<br>\n<p>Use scientific notation</p>\n<br>\n<p>The purpose of scientific notation is to represent numbers that are either too large or too small to be written, just like the two examples from before.</p>\n<br>\n<p>Scientific notation is usually in the 'powers of ten'</p>\n<br>\n<p>Coming back to our galaxy example, if we wish to represent the distance in meters between the Andromeda galaxy to our Milky Way galaxy, here goes the number:</p>\n<br>\n<p>$$ {24000000000000000000000} $$</p>\n<br>\n<p>There is absolutely no way that this is something practical, imagine all the work if we needed to include a number like this in our calculations, instead, it is better to use scientific notation:</p>\n<br>\n<p>$$ {2.4 \\times {10}^{22}} $$</p>\n<br>\n<h3>Changing Units</h3>\n<br>\n<p>I once heard someone ask how to convert square meters to cubic meters.</p>\n<br>\n<p>Jesus did that with water when he turned it into wine.</p>\n<br>\n<p>We can't achieve this yet.</p>\n<br>\n<p>What we can do is convert units that are on the same physical quantity, like length, time, and mass.</p>\n<br>\n<p>We do this by taking advantage of a famous method called <strong>chain-link conversion.</strong></p>\n<br>\n<p>To achieve this conversion we multiply our current measure by a conversion factor.</p>\n<br>\n<p>For instance, because 1 meter and 100 centimeters are basically the same length intervals represented in different units,  we have a conversion unit.</p>\n<br>\n<p>As you can see in the illustration below, the unwanted factors 'cancel' each other leaving us with only the desired unit. In this case the centimeter.</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/tlpc21hbi2w61xhoyfho.png' alt='Conversion Unit'>\n<br>\n\n<h3>Length</h3>\n<br>\n<p>Throughout history, the meter has been defined in a bunch of different ways.</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/r1up4bzfly341zdulriu.png' alt='Length measures'>\n<br>\n\n<p>Back in the 1800s, the meter was defined as one ten-millionth of the distance from the north pole to the equator. Which is equivalent to 1 divided by 10000000.</p>\n<br>\n<p>As you can imagine, this decision for the meter wasn't the most practical.</p>\n<br>\n<p>So they decided to define the meter as the distance between two lines engraved in a platinum-iridium bar.</p>\n<br>\n<p>Since the meter was defined based on a physical object, you can picture the material being subject to temperature, air conditions, and physical damage.</p>\n<br>\n<p>Also, with the advancements being made in quantum physics, they would definitely need a more precise definition, a sort of universal definition.</p>\n<br>\n<p>Then it was later defined as 165076373 wavelengths of an orange-red light emitted by atoms of Krypton-86 in a gas discharge tube.</p>\n<br>\n<p>Why did they choose this awkward number? Dont know.</p>\n<br>\n<p>Just kidding, it was because the new standard would be somewhat equal to the old meter bar standard.</p>\n<br>\n<p>But guess what?</p>\n<br>\n<p>Even more precision was required.</p>\n<br>\n<p>This time around, they needed something constant, a way of universally measuring things, allowing room for accuracy on multiple different branches of physics.</p>\n<br>\n<p>Now this definition resides until today:</p>\n<br>\n<p>' The meter is defined as the distance of the path traveled by light in the vacuum during a time interval of 1/299 792 458 of a second.'</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/oazkdakdi9i0ftq9f2vp.png' alt='Measuring the meter'>\n<br>\n<p>This time interval was purposely chosen based on the speed of light. Since the speed of light is a universal constant and is not subjected to variations like temperature, pressure, or any gradual change over time.</p>\n<br>\n<p>$$ {c = 299\\,792\\,458 \\, \\text{m/s}} $$</p>\n<br>\n<h3>Time</h3>\n<br>\n<p>Some people say that the concept of ‘time’ is just for organizational purposes, like knowing what time to go to bed, what time to wake up, what time to eat, and so on.</p>\n<br>\n<p>While others say that time is the fourth dimension, something that as humans we have yet to understand. Like thinking of time as a physical quantity, but since we don't want to lose ourselves, let's leave this topic for another occasion.</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/pmptqjozq0ffv9kghpzq.png' alt='Time intervals'>\n<br>\n<p>Based on those definitions, in physics, ‘time’ has two roads:</p>\n<br>\n<p>The normal everyday stuff, which you need to know in order to get through your day.</p>\n<br>\n<p>And the scientific road, where time is in terms of 'how long an event lasts' or 'when did it happen'.</p>\n<br>\n<p>A pretty simple example of this is the dawn of the universe which has thought-provoking questions like 'When did the universe begin?' or 'For how long does the universe exist? Was there anything before the Big Bang? '.</p>\n<br>\n<p>Any topic like this always raises those fundamental questions that can leave you with an existential crisis.</p>\n<br>\n<p>As you can imagine, what happened to the standard length model, also happened to the time standard model.</p>\n<br>\n<p>In the beginning, scientists were using a quartz clock, in which inside was a quartz crystal that vibrated naturally, this vibration was used to keep track of time.</p>\n<br>\n<p>We’ve had 10-hour days, 12-hour days, you named.</p>\n<br>\n<p>But it was necessary a better and more precise time standard as technology changes rapidly.</p>\n<br>\n<p>To meet the requirements of the technological advancements being made, atomic clocks were developed.</p>\n<br>\n<p>So since the late 60s, the second has been based on an atomic clock that uses the difference of energy between the two lowest states of energy in a cesium-133 atom.</p>\n<br>\n<p>When the atoms are hit with microwaves in the correct frequency, the Cesium atoms go through transitions from one state to another.</p>\n<br>\n<p>One second is defined as the time taken by 9192631770 cycles of this radiation.</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/xnfbjroqcyhtmczceizo.png' alt='measuring the second'>\n<br>\n<h3>Mass</h3>\n<br>\n<p>How can you know how much something weighs?</p>\n<br>\n<p>Well, you put it on a scale?</p>\n<br>\n<p>Hmm, okay.</p>\n<br>\n<p>But how does the scale know the weight of an object?</p>\n<br>\n<p>Well, basically it's an object that gets compared to another object that gets compared to another object, of course, there is a more complex explanation that involves a load cell that once a force is applied sends an electrical signal that is used to calculate the weight based on the load cell’s bend. </p>\n<br>\n<p>But this is currently not necessary to understand mass and its definitions, so let's continue here.</p>\n<br>\n<p>The standard unit for mass is the kilogram (kg), and it is defined based on a platinum-iridium bar, and it is kept near Paris.</p>\n<br>\n<p>As we can recall, the meter was once defined as the distance engraved on a platinum bar.</p>\n<br>\n<p>The second was once defined based on the motion of the Earth.</p>\n<br>\n<p>Candela was defined in terms of the brightness of a specific type of candle flame.</p>\n<br>\n<p>You can start to see a pattern here, those definitions were all based on physical objects.</p>\n<br>\n<p>The standard unit for mass was the only unit whose definition is still based on a man-made object.</p>\n<br>\n<p>But this changed recently.</p>\n<br>\n<p>And up until May 2019, the kilogram was defined as a platinum-iridium cylinder.</p>\n<br>\n<p>This old definition was due to change, and they knew that.</p>\n<br>\n<p>They needed a definition that would not change with time, nor be subject to physical variations like corrosion, maybe a constant dwelling in nature.</p>\n<br>\n<p>And they choose Planck’s constant for that.</p>\n<br>\n<p>'The kilogram, symbol kg, is the SI unit of mass. It is defined by taking the fixed numerical value of the Planck constant h to be 6.62607015×10−34 when expressed in the unit J⋅s, which is equal to kg⋅m2⋅s−1, where the meter and the second are defined in terms of c and ΔνCs.'</p>\n<br>\n<p>Wait what?</p>\n<br>\n<p>But how is the mass related to Planck’s constant you may wonder?</p>\n<br>\n<p>Let's take a step back here to really understand this.</p>\n<br>\n<p>For starters, Planck’s constant will now be set to a fixed value, which is: </p>\n<br>\n<p>$$ { 6.62607015 \\times 10^{-34} \\, \\text{m}^2 \\, \\text{kg/s}} $$</p>\n<br>\n<p>So from now on, scientists can somewhat safely obtain the mass of a kilogram in terms of Planck’s constant.</p>\n<br>\n<p>All of this is possible because of a measurement instrument called the <strong>kibble balance</strong> (formerly known as the watt balance) named after its inventor Bryan Kibble.</p>\n<br>\n<p>This allows the comparison of electrical power with mechanical power by equalling the mechanical energy exerted by the mass of an object with an equivalent amount of electrical energy.</p>\n<br>\n<p>The Kibble Balance operates in two ways:</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/mv4u8yau6sguokaecpje.png' alt='force mode kibble balance'>\n<br>\n<p>The first way is called the force mode, in which the Kibble balance magnetically levitates the mass object. The test mass exerts a downward force, which is equal to its mass (m) times the local gravity (g).</p>\n<br>\n<p>Then the current applied to the coil is adjusted until the upward force on the coil precisely matches the downward force, when this equilibrium is reached the current is recorded.</p>\n<br>\n<p>We are able to calculate the force with the following equation:</p>\n<br>\n<p>$$ { F = I \\cdot B \\cdot L } $$</p>\n<br>\n<p>Where <strong>I</strong> is the current, <strong>B</strong> is the magnetic field force, and <strong>L</strong> is the strength of the wire in the coil.</p>\n<br>\n<p>But since the product of <strong>BL</strong> is hard to measure, physics provided another way around using induction.</p>\n<br>\n<p>A voltage is induced in a conductor when it travels through a magnetic field, and this voltage is exactly proportional to the field strength and the velocity.</p>\n<br>\n<p>This allows for a second operation called <strong>'velocity mode'</strong>.</p>\n<br>\n<img src='https://res.cloudinary.com/djmr9rxjg/image/upload/v1715527297/Measurament-Article/tqw1m2mur9w9hrgr7z9w.png' alt='velocity mode'>\n<br>\n<p>In <strong>velocity mode</strong>, the test mass is removed from the balance and the coil is moved at a constant velocity. After that, the resulting induced voltage is measured.</p>\n<br>\n<p>We can measure the induced voltage with</p>\n<br>\n<p>$$ { V = v \\cdot B \\cdot L } $$</p>\n<br>\n<p>where <strong>B</strong> and <strong>L</strong> are the exact quantities from before and <strong>v</strong> is the velocity.</p>\n<br>\n<p>After we combine both equations, the <strong>B</strong> and <strong>L</strong> cancel out, leaving us with the following:</p>\n<br>\n<p>$$ { I \\cdot V = m \\cdot g \\cdot V } $$</p>\n<br>\n<p>Electrical power equals mechanical power. We can also solve for mass:</p>\n<br>\n<p>$$ { m = \\frac{I \\cdot V}{g \\cdot v} } $$</p>\n<br>\n<p>But wait, you might be wondering, from where does the Plancks constant come into all of this?</p>\n<br>\n<p>Let me answer that for you.</p>\n<br>\n<p>According to Einstein’s equations of relativity, we know that mass can be quantified in terms of energy, and Planck’s equation states that energy can be converted in terms of the frequency of photons, for instance.</p>\n<br>\n<p>When we take the two equations together we are able to observe that mass, is deeply related to h, which is used to describe the small energy content of individual photons emitted by atoms in hot objects.</p>\n<br>\n<p>To summarize the whole thing, any energy measurement is a mass measurement.</p>\n<br>\n<p>The study of measurement and units allowed us to move away from the physical object definitions and instead stick with constants.</p>\n<br>\n<p>So now the standard unit for mass is defined in terms of the Planck constant, not tied anymore with an imperfect man-made artifact.</p>\n<br>\n<p>So now, the Earth and everything around us could disappear and you would still be able to calculate the mass of an object, with the right tools, anywhere in the universe.</p>\n<br>\n<h3>Wrapping Up</h3>\n<br>\n<p>The universe has been around for quite some time now, and it's always remarkable to witness such advancements in human history. How different branches of human knowledge can come together and develop ways of measuring objects and define standard units for those measures.</p>\n<br>\n<p>From a metal bar to the speed of light and from a platinum-iridium cylinder to Planck’s constant. Incredible stuff.</p>\n<br>\n<p>But is it really enough for the coming years? Will we need to update any of those definitions mentioned above? Will we be able to reconcile quantum mechanics with relativity?</p>\n<br>\n<p>I guess that only time will be able to answer those questions.</p>\n<br>\n<p>And now I will leave you with the following quote by Aristotle:</p>\n<br>\n<p><strong>'We need to use our senses to make sense of reality'</strong></p>\n<br>\n\n\n\n\n",
    "Description": "Physics may sound daunting with all it's discoveries and mysteries, but there is a point in our time and space where complexity meets simplicity. This simplicity comes in form of measures and units. But how does all of this helps us comprehend the laws of the universe? Let's check it out.",
    "Title": "How The Measurement Of Units Changed Physics",
    "UUID": "617827772a604f37b830a1063dbee176",
    "created_at": "20241005 T20:25:28",
    "date": "October 5, 2024",
    "id": 14,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1715461677/article-images/fxrtra7uozjvgmo9uusz.png",
    "tags": "physics",
    "url_title": "how-the-measurement-of-units-changed-physics"
  },
  {
    "Content": "<p>“I can calculate the motion of heavenly bodies, but not the madness of people”</p>\n    <br>\n    <p>This quote reveals how well Newton understood about the physical universe and how little he understood about the complex nature of human behavior.</p>\n    <br>\n    <p>I think is safe to say that Sir Isaac Newton is one of the most important people that have contributed to science, physics, and mathematics.</p>\n    <br>\n    <p>Newton's laws explain practically all the things in our everyday lives that we take for granted, like walking, sitting, driving, running, and so on.</p>\n    <br>\n    <p>They describe motion, the causes of motion, and every aspect related to the subject.</p>\n    <br>\n    <p>Newton’s laws are often described as three separate laws, but when we zoom out and look at the big picture we can see that they are actually pretty close to each other, without the first one we wouldn't have the second one, and without the second one we wouldn't have the third one.</p>\n    <br>\n    <p>Like an old friend of mine used to say: ”They are connecting to each other”\n    <br>\n    <p>So make yourself balanced and let's learn about Newton’s laws.</p>\n    <br>\n    <h3>First Law</h3>\n    <br>\n    <p>“If the net force on a body is zero the velocity will not change.”</p>\n    <br>\n    <p>An object at rest remains at rest, and an object in motion remains in motion at a constant speed and in a straight line unless acted on by an unbalanced force.</p>\n    <br>\n    <p>In other words, objects tend to keep doing what they are doing. Imagine a ball, if the ball is moving it tends to stay moving, and if the ball is stopped tends to stay stopped.</p>\n    <br>\n    <p>In the context of the ball, the unbalanced forces would be the friction between the ball and the ground and the air resistance, eventually stopping the ball.</p>\n    <br>\n    <p>So, if there was no friction between the ball and the ground and the resistance of the air was zero, the ball would just move forever at a constant speed on a straight line.</p>\n    <br>\n    <p>This law is often referred to as the Law of Inertia.</p>\n    <br>\n    <p>To get an object to move you must first overcome the Inertia.</p>\n    <br>\n    <p>This may sound silly but have you ever wondered why it is easier to push a bike compared to pushing a truck?</p>\n    <br>\n    <p>Well, the answer lies in Inertia</p>\n    <br>\n    <p>But what is Inertia?</p>\n    <br>\n    <p>Inertia is the tendency of an object to resist changes in a state of motion</p>\n    <br>\n    <p>Inertia is the reason why it is easier to push a bike compared to pushing a truck. Inertia is also the reason why an object tends to keep doing what is doing.</p>\n    <br>\n    <p>To move anything, you must first overcome Inertia.</p>\n    <br>\n    <p>Here are a few examples:</p>\n    <br>\n    <p>At the beginning of a game of soccer, the ball will stay will the middle of the field unless the player makes the first kick, in other words, an unbalanced force will act on the ball.</p>\n    <br>\n    <p>Another common example in our everyday lives is when we suddenly hit the brakes on the car, the Inertia of our body tends to move us forward even after the car is stopped, according to Newton’s first law.</p>\n    <br>\n    <p>That leads us directly to the second law.</p>\n    <br>\n    <h3>Second Law</h3>\n    <br>\n    <p>“The acceleration of an object depends on the object's mass and the amount of force applied.”</p>\n    <br>\n    <p>According to Newton's second law, to move an object we need to apply some force to the object, causing the object to accelerate.</p>\n    <br>\n    <p>And since mass is also involved, to move an object with a larger mass we need a higher acceleration.</p>\n    <br>\n    <p>Here is the formula:</p>\n    <br>\n    <p>$$ { \\sum F = m \\cdot a } $$</p>\n    <br>\n    <p>Where F is the total or net force on a given system, m is the mass of the body, and a is the acceleration.</p>\n    <br>\n    <p>The total force on a body is equal to the product of the body’s mass and its acceleration.</p>\n    <br>\n    <p>As we can see, the acceleration of an object depends directly on the force applied.</p>\n    <br>\n    <p>It's essential to notice that for this law to be applicable, the mass of the object must be constant.</p>\n    <br>\n    <p>Here are some examples:</p>\n    <br>\n    <p>In the supermarket, we notice that is easier to push the cart when it's empty, that's because as the cart gets filled with more stuff the mass increases, and that requires a greater force to accelerate the cart.</p>\n    <br>\n    <p>As I mentioned earlier, this also applies to moving a bike compared to moving a truck, the bike has less mass so it is easier to push, while the truck has much more mass so it will require a lot of force in order to accelerate.</p>\n    <br>\n    <h3>Third Law</h3>\n    <br>\n    <p>“For every action, there is always an equal and opposite reaction”</p>\n    <br>\n    <p>The third law explains why when we start riding a bike we go forward instead of backward or in any other direction.</p>\n    <br>\n    <p>When we drop a ball on the ground the ball exerts a force on the ground, that's the action, and the ground immediately reacts by exerting another equal force on the ball in the opposite direction.</p>\n    <br>\n    <p>So a better definition for Newton’s third law would be: For every force, there is an equal and opposite force.</p>\n    <br>\n    <p>Since the forces are equal in magnitude and opposite in direction.</p>\n    <br>\n    <p>Picture the Earth orbiting the Sun, the Sun is more massive than the Earth, yet both exert the same force on each other.</p>\n    <br>\n    <h3>Conclusion</h3>\n    <br>\n    <p>Throughout this article we noticed that Newton’s laws are not just mere concepts or formulas that we find in a boring textbook in your grandma's bookshelf, they are actual principles that shape our daily lives and the world around us.</p>\n    <br>\n    <p>That’s what is awesome about those laws.</p>\n    <br>\n    <p>Understanding those laws is like achieving the maximum level on a game, making you aware of every single action, response, and principle of that game</p>\n    <br>\n    <p>It's important to mention that Newton’s laws are excellent for modeling our real-world experiences, but they do have some limitations.</p>\n    <br>\n    <p>Those limitations happen when a given object starts to approach the speed of light or is on the atomic scale.</p>\n    <br>\n    <p>If an object does not have a constant mass, or it is traveling close to the speed of light we need to consider relativity, so the laws of  Newton no longer fit the situation.</p>\n    <br>\n    <p>For the sake of revision:</p>\n    <br>\n    <p>First law: An object at rest remains at rest, and an object in motion remains in motion at constant speed and in a straight line unless acted on by an unbalanced force.</p>\n    <br>\n    <p>Second law: The acceleration of an object depends on the object's mass and the amount of force applied.</p>\n    <br>\n    <p>Third law: Whenever one object exerts a force on another object, the second object exerts an equal and opposite force on the first.</p>",
    "Description": "Understanding Newton’s Laws is like knowing all the rules of a game. Learn the Fundamental Laws That Shape Our Everyday Lives, Even without us knowing.",
    "Title": "How The Laws Of Newton Shape Our Reality",
    "UUID": "9c4585298997456bacc351cf5fbce15a",
    "created_at": "20240928 T20:14:16",
    "date": "September 28, 2024",
    "id": 4,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322237/article-images/llrorwfuximff6te5qgp.jpg",
    "tags": "physics",
    "url_title": "how-the-laws-of-newton-shape-our-reality"
  },
  {
    "Content": "<p>The universe as we know is more than 13 billion years old.</p>\n    <br>\n    <p>Just so you know the difference between a million and a billion, a million seconds is around 12 days. On the other hand, a billion seconds is approximately 32 years. Big difference.</p>\n    <br>\n    <p>When we take a look at the cosmic scale, we can say for sure that humanity is pretty young when we really stop to look at the time.</p>\n    <br>\n    <h3>Historical Context</h3>\n    <br>\n    <p>The Kardashev Scale was born when the Russian/Soviet Astrophysicist Nikolai Kardashev was trying to comprehend life outside earth.</p>\n    <br>\n    <p>He noticed that if we could determine the amount of energy that some species consume, we can know their technological advancements.</p>\n    <br>\n    <p>And if we know the technological advancement of a species we can develop a method to measure that.</p>\n    <br>\n    <p>So The Kardashev Scale was created.</p>\n    <br>\n    <p>A method of measuring the level of a civilization based on the amount of energy that the civilization consumes.</p>\n    <br>\n    <p>Those civilizations range from extracting all the energy available from their planet, to colonizing galaxies and using black holes as sources of energy.</p>\n    <br>\n    <p>Pretty cool right?</p>\n    <br>\n    <p>So let's take a brief look at the main types of civilizations.</p>\n    <br>\n    <p>A Type 1 civilization is able to harness all the energy at a planetary level.</p>\n    <br>\n    <p>A Type 2 civilization on the other hand, is capable of extracting all the energy from their star and planetary system.</p>\n    <br>\n    <p>And a Type 3, is able to use all the energy available in their current galaxy.</p>\n    <br>\n    <p>It is important to notice that the scale goes on and on, but for the sake of our understanding of the universe, let's keep this list short.</p>\n    <br>\n    <p>So get in your spaceships and let's look at these civilizations.</p>\n    <br>\n    <h3>Type 1</h3>\n    <br>\n    <p>I am going to start by breaking your heart, the human race has not reached Type 1 yet.</p>\n    <br>\n    <p>We are still using energy resources from dead animals and plants.</p>\n    <br>\n    <p>Humanity has come a long way, in the past 200 years we went from extreme poverty to putting a man on the moon.</p>\n    <br>\n    <p>Still, we have a long road until we reach Type 1.</p>\n    <br>\n    <p>But what a Type 1 civilization would look like you might ask</p>\n    <br>\n    <p>Well, for starters, a Type 1 civilization would be able to completely shift the weather as it sees fit.</p>\n    <br>\n    <p>At the same time, the civilization would have total control over natural events such as volcanoes, earthquakes, hurricanes, and so on.</p>\n    <br>\n    <p>In other words, harnessing all the energy available from their planet and outside sources from the earth, like the sun energy.</p>\n    <br>\n    <p>A civilization like that would also be able to achieve amazing stuff like change the weather, control pollution, bring back extinct animals, recreate ecosystems, and much more.</p>\n    <br>\n    <p>In summary, they would be able to control anything on a planetary level.</p>\n    <br>\n    <h3>Type 2</h3>\n    <br>\n    <p>Type 2 civilizations are also known as “stellar civilizations”, since they are able to harness all the energy from their planetary system.</p>\n    <br>\n    <p>Here is when things start to get interesting.</p>\n    <br>\n    <p>Even though humanity will only reach Type 2 civilization in the next thousand years we can still picture what that would look like.</p>\n    <br>\n    <p>A Dyson Structure is a device built around the sun with the purpose of gathering all the energy available from the sun. This device was first presented by Freeman Dyson.</p>\n    <br>\n    <p>Imagine a gigantic hollow sphere built around the sun, that's what a Dyson sphere is.</p>\n    <br>\n    <p>With that amount of energy a Type 2 civilization might be able to perform space travels, terraforming planets, mine asteroids, achieving amazing breakthroughs in biology, physics, engineering, medicine, chemistry, and so on.</p>\n    <br>\n    <p>Hypothetically, a Type 2 civilization would be able to completely take over the entire planetary system, performing space travels, gathering resources, building massive structures on planets, and achieving all kinds of breakthroughs.</p>\n    <br>\n    <p>But again, this is child play compared to a Type 3 civilization. </p>\n    <br>\n    <h3>Type 3</h3>\n    <br>\n    <p>Civilizations of Type 3 are capable of using all the energy available from their galaxy.</p>\n    <br>\n    <p>Just for context, the milky way is around 100.000 light years in diameter. In only one year, light can travel a distance of 9.5 trillion kilometers, you can do the math, that is way too big.</p>\n    <br>\n    <p>Our radio transmissions go as far as 200 light years, that's nothing compared to the size of the milky way.</p>\n    <br>\n    <p>But believe if you want, a Type 3 civilization is able to control the energy of its entire galaxy.</p>\n    <br>\n    <p>How? That’s a question for our future descendents.</p>\n    <br>\n    <p>A civilization of this magnitude would be able to harness energy from black holes, move planets, perform interstellar travels, send messages to the other side of the galaxy, you name it.</p>\n    <br>\n    <p>A galaxy would be like a white canvas for them, ready to be painted as they wish.</p>\n    <br>\n    <p>Perhaps those types of civilizations are beyond our current understanding of the universe, or perhaps they don't even exist, and that is either scary or awesome because we might be the first ones to reach this kind of level.</p>\n    <br>\n    <h3>We might have some problems on the way</h3>\n    <br>\n    <p>In life, not everything happens as we expect.</p>\n    <br>\n    <p>This is precisely true for human civilization. Because, as we know, throughout the entire span of time, earth has faced multiple events like asteroid collision, glacial ages, extinctions, the list goes on.</p>\n    <br>\n    <p>Before we even think about other planets, we must solve problems right here on earth, otherwise we won't be able to evolve if we go extinct in the next 100 to 200 years.</p>\n    <br>\n    <p>And for the first time in history we have the power to destroy ourselves.</p>\n    <br>\n    <p>The Kardashev Scale shines light on a bright future ahead of us with countless possibilities, but let's not forget that everything begins right here on earth.</p>\n    <br>",
    "Description": "Taking notice of world events that happened in the past few years and are currently happening, whether it's wars, climate change, or natural disasters, one main question that comes up with the subject: Will humanity ever reach its peak?",
    "Title": "Perhaps Humanity Will Never Reach The Stars",
    "UUID": "a4244d7f9de942e39e719b6c482949fe",
    "created_at": "20240921 T20:15:50",
    "date": "September 21, 2024",
    "id": 5,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322237/article-images/lazkbc469v6xxyfljodb.jpg",
    "tags": "physics",
    "url_title": "perhaps-humanity-will-never-reach-the-stars"
  },
  {
    "Content": "<p>Humans built computers to expand our brains. Initially, scientists created computers to perform mathematical operations or repetitive tasks, but they ended up being extremely useful for various other things, such as problem-solving, communication, artificial intelligence, and more.</p>\n    <br>\n    <p>All of this is based on just zeros and ones (0, 1). With the advancement of technology, computers have become increasingly powerful in a very short period. To put it into perspective, the Apollo moon landing could be accomplished using a few Nintendo consoles.</p>\n    <br>\n    <p>With this in mind, you might be wondering what Computer Science is and what it studies. Computer Science studies what computers can do, covering a wide range of subjects. In this article, I will divide it into three parts: theory, computer engineering, and applications.</p><br>\n\n    <h3>Some Historical Context</h3><br>\n    \n    <p>To begin, let's start with the father of Computer Science, Alan Turing. He developed the concept called the Turing Machine, which is a concept given to a computer that can be used for various things. Eventually, people created new designs for computers, but these designs are all equivalent to a Turing Machine.</p>\n    <br>\n    <p>A Turing Machine is composed of a long tape containing symbols, the central part (head) that can read and write symbols on the tape, and the register that stores information along with a list of instructions.</p>\n    <br>\n    <p>Today, the tape is like a computer's memory (RAM) and the head is the CPU. Lambda Calculus is used in computers as the basis for programming languages.</p><br>\n    \n    <h3>Computability Theory</h3><br>\n    \n    <p>This is an area of mathematics and computer science that seeks to perform procedures effectively following a set of rules. This theory classifies problems that, due to their own nature, can or cannot be solved.</p>\n    <br>\n    <p>An example of this is the Halting Problem, which tries to predict whether a program will stop functioning or continue running forever.</p><br>\n\n\n    <h3>Computational Complexity</h3><br>\n    <p>Another area of Computer Science is computational complexity. Computational complexity aims to classify and compare the difficulty of solving problems.</p>\n    <br>\n    <p>There are problems that can theoretically be solved, but they require enormous computational power and would take more time than the age of the universe. Therefore, computational complexity attempts to classify these problems.</p>\n    <br>\n    <p>There are several real-world problems that fall into this category. Scientists have various tricks to approximate these answers, but it’s never certain if these answers are the best ones.</p>\n    <br>\n    <h3>Algorithms</h3><br>\n<p>An algorithm is a set of instructions designed to solve a specific problem. An algorithm is like a recipe for baking a cake.</p>\n<br>\n<p>One of the main goals of an algorithm is to perform a task or solve a problem as efficiently as possible, meaning as quickly as possible. Different algorithms may arrive at the same result in different times, and this is studied in algorithm complexity.</p>\n<br>\n<h3>Information Theory</h3><br>\n<p>Information theory is another area of computer science that studies the properties of information and how this information can be stored, measured, and shared.</p>\n<br>\n<p>An example of this is how much you can compress information, making it occupy less memory while preserving the information completely. You can learn more about this in the theory of codes.</p>\n<br>\n<h3>Cryptography</h3><br>\n<p>We use cryptography in messaging apps every day. Cryptography is extremely important when it comes to securely sending information over the internet.</p>\n<br>\n<p>There are various types of cryptography that use complex mathematical operations to keep information secure.</p>\n<br>\n<h3>Graph Theory</h3><br>\n<p>In mathematics and computer science, graph theory is the branch that studies graphs, a mathematical structure used to represent relationships between objects or information. A set of vertices is connected by edges or lines, forming a graph.</p>\n<br>\n<h3>Data Structures</h3><br>\n<p>In computing, data structures are a way of storing and managing information with the goal of accessing and modifying information efficiently.</p>\n<br>\n<p>Some examples of data structures are arrays, stacks, hash tables, queues, heaps, graphs, and linked lists.</p>\n<br>\n<h3>Computational Geometry</h3><br>\n<p>Computational geometry is another area of computer science that involves the creation, analysis, and implementation of efficient algorithms for solving geometric problems.</p>\n<br>\n<p>To keep it clear, there are several other areas that I haven’t mentioned to avoid making the article too long. Examples of these areas include quantum computing, parallel and distributed programming, and much more.</p>\n<br>\n<h3>Computer Engineering</h3><br>\n<p>In today’s world, computers are required to do hundreds of things at the same time, which can be a challenge in computer development. Therefore, scientists need to create them to be fast and efficient.</p>\n<br>\n<p>Any task you perform on a computer goes through the CPU. When you perform multiple tasks simultaneously, the CPU needs to switch between these tasks to complete them as quickly as possible, and this is controlled by a scheduler, whose main function is to optimize task execution.</p>\n<br>\n<h3>Computer Architecture</h3><br>\n<p>In computing, computer architecture is a set of rules and methods that describe implementations, functionalities, and the organization of systems. Basically, it is how a processor is developed to perform certain tasks.</p>\n<br>\n<p>CPUs serve a general purpose, GPUs are implemented in graphics, and FPGAs can be programmed to be extremely fast for a specific set of activities.</p>\n<br>\n<h3>Softwares & Programming Languages</h3><br>\n<p>Software is written in some programming language. Programming languages are how humans give instructions to computers, and these languages can vary depending on the task.</p>\n<br>\n<p>This code that humans write needs to be converted into machine code that computers understand. This is where compilers come in.</p>\n<br>\n<h3>Operational Systems</h3><br>\n<p>The operating system is the most important logical part of a computer. It controls what the user interacts with and sees, and also controls how programs will run on the physical part of the computer.</p>\n\n<p>As a result, developing a good operating system can be a significant challenge.</p>\n<br>\n<h3>Software Engineering</h3><br>\n<p>This leads us to software engineering, where you write a set of instructions determining the computer’s actions. Creating software needs to be as efficient as possible and free of errors. Some of the best practices people follow to build good software are object-oriented design, unit testing, and version control.</p>\n<br>\n<p>“Creating good software is a form of art because you need to convert your creative ideas into logical instructions.”</p>\n<br>\n<p>Other highly important areas worth mentioning are networking, where multiple computers communicate to solve a specific problem, data management in which computers store and manage large amounts of information, and performance, which focuses on analyzing how computers perform in different tasks.</p>\n<br>\n<h3>Applications</h3><br>\n<p>This is the part where computers can solve real-world problems, and this is present in various programs, apps, and websites we use in our daily lives.</p>\n<br>\n<p>When you go on a trip, you want to have the best trip money can buy, solving an optimization problem. Optimization problems consist of finding the best or most efficient path, potentially saving millions of dollars for companies.</p>\n<br>\n<p>This is related to the Boolean Satisfiability Problem, where you consider whether a logical formula can be satisfied or not. This was one of the first problems considered almost impossible to solve.</p>\n<br>\n<h3>Artificial Intelligence</h3><br>\n<p>Artificial intelligence is one of the main fields of research in computer science. Computers have the capacity to extend our thoughts, meaning developing computers that can think for themselves.</p>\n<br>\n<h3>Machine Learning</h3><br>\n<p>One of the study areas of artificial intelligence is machine learning. Its main function is to create algorithms and techniques that allow computers to learn based on large amounts of information.</p>\n<br>\n<p>With this, they use the learning for something useful, such as making decisions on their own or classifying something.</p>\n<br>\n<h3>Computer Vision</h3><br>\n<p>Another field of computer science is computer vision, making computers see the same way humans do, using image processing techniques.</p>\n<br>\n<h3>Natural Language Processing</h3><br>\n<p>As the name suggests, natural language processing aims to make computers understand and communicate using human language or process vast amounts of information using words.</p>\n<br>\n<p>This uses knowledge representation, where information or words are organized according to their relationships, such as words with similar meanings.</p>\n<br>\n<h3>Big Data</h3><br>\n<p>Machine learning algorithms have improved due to the immense amount of data available. Big Data’s function is to analyze and manage these large amounts of data.</p>\n  <br>\n<p>We also receive even more information due to the Internet of Things, including information and communications between objects through the internet.</p>\n<br>\n<h3>Hacking</h3><br>\n<p>Hacking is considered by many to be illegal, and most of the time, it is. It involves trying to find vulnerabilities in computer systems to gain access to any available information. This can be used for both good and bad purposes.</p>\n<br>\n<h3>Computer-Human Interaction</h3><br>\n<p>The goal of human-computer interaction is to make the use of systems and computers as easy and intuitive as possible.</p>\n<br>\n<p>Other fields worth mentioning are augmented reality, virtual reality, and telepresence. These areas aim to improve our experience with reality.</p>\n<br>\n<p>Finally, we have Robotics, providing computers with a physical form.</p>\n<br>\n<h3>Conclusion</h3><br>\n<p>The goal of this article was to briefly introduce the different fields of computer science and some of its applications.</p>\n<br>\n<p>Computer Science is an area that is still evolving, although the physical aspect is reaching a limit as scientists are having difficulties in reducing the size of transistors.</p>\n<br>\n<p>Computers and technology have had a significant impact on humans, and it will be even more interesting to see how far it will go.</p>",
    "Description": "Computer Science is often disregarded as a science. Take a look at how big it is.",
    "Title": "The Computer Science Landscape",
    "UUID": "34dd3875b1da47f2863e9835136953c2",
    "created_at": "20240914 T20:23:46",
    "date": "September 14, 2024",
    "id": 12,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322237/article-images/b3fvmqaou4v4n1f3lxkj.jpg",
    "tags": "computer science",
    "url_title": "the-computer-science-landscape"
  },
  {
    "Content": "<p>Let's start this one with a thought experiment, have you ever got to a point while trying to be productive or looking for ways to be productive, where, for instance, instead of studying you were watching a YouTube video on how to study effectively?</p>\n    <br>\n    <p>It is funny when we think about it.</p>\n    <br>\n    <p>Most people get stuck in this never-ending loop of trying to be productive, trying to find the perfect study routine or the perfect hour to code, but the truth is that there is no such thing other than just doing the thing that the back of your mind is telling you to do.</p>\n    <br>\n    <p>And the same logic applies to becoming a so-called “10x developer” or a hyper-productive developer.</p>\n    <br>\n    <p>You won't be able to write code without someone guiding you by hand if you don't understand and break free of a couple of simple concepts.</p>\n    <br>\n    <h3>What Is A 10x Developer?</h3>\n    <br>\n    <p>As you might have figured out already, a 10x developer is a developer that is 10x more productive and efficient when compared to regular developers.</p>\n    <br>\n    <p>Putting it simply, if a regular developer takes 10 hours to solve a problem, a 10x developer will take 1 hour to solve the same problem.</p>\n    <br>\n    <p>But like always, there is a catch.</p>\n    <br>\n    <h3>The 10x Developer is Just a Myth</h3>\n    <br>\n    <p>I remember back in the PlayStation 2 era, when playing GTA San Andreas most people, including me, thought that if you went to a specific location on the map you would find the Bigfoot.</p>\n    <br>\n    <p>The information quickly spread across many players, because in those days we only had forums on which people could communicate, so there weren't a lot of ways to verify if the game had this mythical creature.</p>\n    <br>\n    <p>But unfortunately, that was just a myth.</p>\n    <br>\n    <p>Just like the concept of the 10x developer.</p>\n    <br>\n    <p>To clarify though, we might have developers among us who can produce 10 times more code than the average developer.</p>\n    <br>\n    <p>But don't get your expectations too high, perhaps they are not what you expect them to be.</p>\n    <br>\n    <p>So just like with the Bigfoot myth from GTA San Andreas, some actions led to the creation of the myth of the 10x developer.</p>\n    <br>\n    <p>And according to my fellow <a href='https://www.simplethread.com/author/jetheredge/' target='_blank' rel='noreferrer' class='newpage-link'>Justin Etheredge</a>, here are a few, let's say, archetypes, or in other words engineers that helped build the foundation of the 10x myth.</p>\n    <br>\n    <h3>The One Who Prefers The Path Of Least Resistance</h3>\n    <br>\n    <p>We all have that one guy in school who for the group project, always did the introduction and bibliography and called it a day.</p>\n    <br>\n    <p>The same thing happens with software engineering, there is the person who is always picking the easiest tasks out of the board.</p>\n    <br>\n    <p>So when the day ends the project leader looks at the board that is full of completed tasks by the same person and says: “Wow, you put in the hours today”.</p>\n    <br>\n    <h3>The One Who Tries To Reinvent The Well</h3>\n    <br>\n    <p>This one is like creating an autonomous robot just to make a simple sandwich.</p>\n    <br>\n    <p>People always consider these types of developers as 10x developers just because they like to make a lot of noise about any problem they are solving.</p>\n    <br>\n    <p>But at the end of the day, it's just complex solutions to simple problems.</p>\n    <br>\n    <p>Don't get me wrong, it's awesome to have someone who can formulate and execute complex ideas, we just need to know in which situations this will be useful.</p>\n    <br>\n    <h3>The Half Finisher</h3>\n    <br>\n    <p>“It is better not doing something than doing something in half”.</p>\n    <br>\n    <p>I think we all did this at some point in our lives, even with coding.</p>\n    <br>\n    <p>Marking a task as complete, even though you did not complete the task is like twisting the fabric of reality or playing with the third law of Newton, action-reaction.</p>\n    <br>\n    <p>Eventually, all that uncompleted work will catch up to you, creating a huge mess and making other developers stop their work just to fix something that could’ve been easily avoided.</p>\n    <br>\n    <h3>The One Whos Keeps On Coding </h3>\n    <br>\n    <p>In all human endeavors, most of the time quantity does not equal quality.</p>\n    <br>\n    <p>Of course, there are situations like a deadline for a project that will require you to write code faster.</p>\n    <br>\n    <p>But nine out of ten times rushed code ends up with poor quality. Having to rely on teammates to clean up afterward.</p>\n    <br>\n    <p>Then we have a snowball effect.</p>\n    <br>\n    <h3>Why do We Have A Concept Like This?</h3>\n    <br>\n    <p>I just listed a few examples of programmers who give credit to the 10x developer myth, but that does not explain the full scope of the situation.</p>\n    <br>\n    <p>You might be wondering why or how a concept like this came into existence.</p>\n    <br>\n    <p>We can look back 70 years and start to see the field of software engineering coming to life in the form of assembly language and other low-level languages. People were starting to write code during World War II.</p>\n    <br>\n    <p>So it is definitely safe to say the programming goes back a while now.</p>\n    <br>\n    <p>Throughout the years we had so many people writing code, building stuff, and helping the industry grow and at the same time, the concept of a 10x developer was gradually rising.</p>\n    <br>\n    <p>So you can imagine a few developers coming and going, each and every single one of them having a unique way of being, whether is writing code or just their personality.</p>\n    <br>\n    <p>The first reason that might have led to the creation of the 10x myth is that developers with more experience write far more code than other developers with less experience, making the more experienced ones stand out in the long term</p>\n    <br>\n    <p>Another reason for that is simply the visibility.</p>\n    <br>\n    <p>Bill Gates is not a better coder just because he created Microsoft, Mark Zuckerberg is also not a better coder just because he developed Facebook, and the same applies to anyone.</p>\n    <br>\n    <p>Success stories like the ones from above might guide you in the wrong direction, giving too much credit to extraordinary achievements.</p>\n    <br>\n    <p>In any science, whether in chemistry, physics, or medicine, we all have this tendency to put certain people on pedestals, especially with coding when we all give too much credit to a single individual and forget all the teamwork along the way.</p>\n    <br>\n    <p>Lastly, it is important to point out that since programming is mostly a creative endeavor, we still do not have practical ways to quantify metrics, unlike a player in a soccer match in which we can tell if the player played well based on how many goals he scored or how many passes he got it right.</p>\n    <br>\n    <h3>What it Really Means to be a Hyper-Productive Developer</h3>\n    <br>\n    <p>In any realm of human endeavor, being productive often will lead you to subjects like:</p>\n    <br>\n    <p>Manage your time effectively, set clear tasks, or be clear about your goals.</p>\n    <br>\n    <p>While all those topics are valid, It took me some time to understand this straightforward thing:</p>\n    <br>\n    <p>All these tips and tricks will most certainly lead to some form of procrastination because, at the end of the day, you are not focusing on getting the work done, you are just worried about implementing methods and tips that will offer you a false feeling of job done.</p>\n    <br>\n    <p>So how can you become a developer who will stand out from the crowd?</p>\n    <br>\n    <p>One of the simplest and most common, yet effective, advice is to always receive new knowledge, and never stop learning. Look at challenges as opportunities for growth.</p>\n    <br>\n    <p>Technology is crazy, it never stops changing. You cannot just learn HTML, CSS, and JavaScript and call it a day. You must go beyond that, learning new frameworks, tools, and libraries.</p>\n    <br>\n    <p>You must always be a sponge when it comes to new information, but at the same time, you also need to apply this new information to your life, always expanding your horizon.</p>\n    <br>\n    <h3>Look For These Type Of Developers Below</h3>\n    <br>\n    <p>Earlier in the article, I presented to you some archetypes of developers that might reinforce the 10x myth.</p>\n    <br>\n    <p>But now that you know which types of developers you want to avoid, you may be wondering what are some developers that will definitely add value to my team.</p>\n    <br>\n    <p>You can also take this list as an inspiration for becoming one of them.</p>\n    <br>\n    <h3>The Interrogator</h3>\n    <br>\n    <p>“The man who asks a question is a fool for a minute, the man who does not ask is a fool for life.”</p>\n    <br>\n    <p>I remember in my first job as a developer I had this mentor who would always explain how things work on a given project, so most of the time I would ask questions to him, so whenever I didn't ask any questions he would always point out that maybe I did not fully understand something.</p>\n    <br>\n    <p>People often assume that asking questions shows signs that you do not completely understand the subject at hand.</p>\n    <br>\n    <p>But asking questions is the most efficient way to understand anything in life. This is the way that developers like this will go about solving any problem.</p>\n    <br>\n    <p>This allows the person to understand every single aspect of the problem, leaving no stone unturned.</p>\n    <br>\n    <h3>I Am A Simple Man</h3>\n    <br>\n    <p>These are the types of developers that can take any kind of complex problem and solve it in the most simple and unimaginable way possible. I bet that those kinds of developers could solve quantum gravity in a cave with a box of scraps.</p>\n    <br>\n    <p>Having developers who can solve complex problems in simple ways can make a positive impact on your team.</p>\n    <br>\n    <h3>The Ones That Fix The Problem Instead </h3>\n    <br>\n    <p>Those types of developers will go a long way to solve any problem but they are hard to come by.</p>\n    <br>\n    <p>You can argue that most of the time this is not the best practice and perhaps it is counter-intuitive. But there are times when instead of trying to find a solution, we might as well redesign the problem in a way that fits the current context of the problem we are trying to solve.</p>\n    <br>\n    <h3>The Obsessor</h3>\n    <br>\n    <p>Some people say that a problem is a chance for you to do your best, while others say that to solve a problem we need to dig at the roots instead of hacking the leaves.</p>\n    <br>\n    <p>And that is incredibly true for the types of developers who just won't give up when working through a problem.</p>\n    <br>\n    <p>Those types of developers wake up and go to sleep thinking about the problem and they will not rest until the problem is not solved.</p>\n    <br>\n    <h3>Knows One Thing At Its Full Length</h3>\n    <br>\n    <p>Let me ask you a question:</p>\n    <br>\n    <p>Is it better to know 25% about 4 different things or know 100% about 1 thing?</p>\n    <br>\n    <p>You simply cannot compete with the developers that chose the latter.</p>\n    <br>\n    <p>That is the reason you should always look for someone with a deep understanding of a subject, usually that person will be able to solve any problem in that realm.</p>\n    <br>\n    <h3>Slows Down To Speed Up</h3>\n    <br>\n    <p>“Give me six hours to chop down a tree and I will spend the first four sharpening the axe”.</p>\n    <br>\n    <p>That is also true when it comes to writing code.</p>\n    <br>\n    <p>As you may know, writing code is the easiest part.</p>\n    <br>\n    <p>The challenge lies in coming up with the solutions for the problem you are trying to solve.</p>\n    <br>\n    <p>Developers like this are exceptional because they don't just go with the first solution that comes to their mind, they wait, research, and try to find the best practices</p>\n    <br>\n    <p>And only after this extensive process they will write the code and declare the problem solved.</p>\n    <br>\n    <h3>Bullseye</h3>\n    <br>\n    <p>it's been proved that 2 hours of focused work is better than 8 hours of unfocused work.</p>\n    <br>\n    <p>We have been seeing a lot of news about people getting easily distracted because of social media, phones, or anything that might grab our attention.</p>\n    <br>\n    <p>As a developer who spends most of the day staring at a screen, we can easily fall into this trap, it all starts with checking email but then when we see, another full hour goes by.</p>\n    <br>\n    <p>With that in mind, in today's world just knowing how to code is not enough, it is a must to be able to block all distractions and lock into the flow.</p>\n    <br>\n    <p>When it comes to productivity and getting the work done, these types of developers are the ones who usually excel at that.</p>\n    <br>\n    <h3>Wrapping Up</h3>\n    <br>\n    <p>I hope that at this point you are more familiar with all the different types of developers in today's world.</p>\n    <br>\n    <p>With this in mind, perhaps you might want to avoid a few types.</p>\n    <br>\n    <p>But at the end of the day, they all contribute in some way to the community.</p>\n    <br>\n    <p>See you in the next one.</p>\n    <br>",
    "Description": "The topic revolving around the 10x developer its been lurking on the internet these days. This fancy term might be appealing to some people, but let's understand the problem underlying the term.",
    "Title": "The Myth Of The 10x Developer",
    "UUID": "06af142bbc004cab841fffb961bc94ba",
    "created_at": "20240907 T20:11:26",
    "date": "September 7, 2024",
    "id": 2,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322238/article-images/onhqs1f9dkyj0dtikfqo.png",
    "tags": "computer science",
    "url_title": "the-myth-of-the-10x-developer"
  },
  {
    "Content": "<p>When we come across the word “design” we often think about something specific, the process of creating and planning something or solving a problem, always with a goal in mind, just like placing the last piece in a giant puzzle.</p>\n    <br>\n    <p>Perhaps it is safe to say that designs should be specific to the problem at hand, and at the same time, they should also address future issues that might or might not occur.</p>\n    <br>\n    <p>As you dive into the Object-Oriented World you will start to notice a lot of experienced developers tell you not to reinvent the wheel, in other words, use solutions that worked for them in the past.</p>\n    <br>\n    <p>So, once you start doing this, you will eventually realize that exist patterns in those same solutions, and you will start to find relations that you didn't know existed before, allowing you to take advantage of these relations to enhance your workflow and coding experience.</p>\n    <br>\n    <p>But you might be wondering what exactly is a design pattern, how it works, and why it is so important in the coding world. So, without wasting any time let's get straight into answering those questions.</p>\n    <br>\n    <h3>What is a Design Pattern?</h3>\n    <br>\n    <p>You know the saying: “If there is a sign, there is a history behind it”.</p>\n    <br>\n    <p>As I mentioned, before every design pattern there was once a problem.</p>\n    <br>\n    <p>Design patterns are solutions to recurring problems, Design Patterns provide you with descriptions of how to solve a problem. Instead of having a boilerplate code ready to copy and paste.</p>\n    <br>\n    <p>They represent some level of abstraction that addresses common issues in the Object-Oriented realm.</p>\n    <br>\n    <p>What this means is that Design Patterns are not about specific lines of code or are attached to a programming language, they do not focus on the technical level, instead, they focus on the overall structure of the code, providing you with efficient ways to solve problems.</p>\n    <br>\n    <p>Design Patterns are divided into four fundamental categories.</p>\n    <br>\n    <h3>Pattern Name</h3>\n    <br>\n    <p>The first one, and perhaps the most important, is the name of the Pattern, as we know the purpose of a name is to uniquely identify a person, a concept, or any entity.</p>\n    <br>\n    <p>The Pattern name helps us instantly visualize and communicate the big picture of the problem, like what is this going to solve? What will it look like?</p>\n    <br>\n    <h3>The Problem</h3>\n    <br>\n    <p>The second one is the actual problem, before applying any pattern we must first understand the problem at its full length, and there are a couple of ways to go about understanding the problem.</p>\n    <br>\n    <p>Since each design pattern will focus on a particular Object-Oriented problem, we must have at the tip of our pen all the consequences, constraints, and trade-offs of its use. After getting all of this out of the way, the problem will become crystal clear.</p>\n    <br>\n    <h3>The Solution</h3>\n    <br>\n    <p>Having taken the time to understand the problem we can start thinking about the solution. The solution will often describe the elements that combined, make up the full design, that includes the relationships, classes, objects, and so on. Solution and problem will always work together when applying any pattern.</p>\n    <br>\n    <h3>The Consequences</h3>\n    <br>\n    <p>And the last one is the consequences. Since programming is all about trade-offs, there will be situations where, for instance, time will be extremely valuable, but using a faster solution might cost you more memory, so you must always be aware of consequences when choosing a pattern.</p>\n    <br>\n    <h3>How to Know Which One To Use</h3>\n    <br>\n    <p>It is funny that we have at our disposal formulas that can estimate the mass of a black hole. Still, sadly there is not a universal formula that can calculate the correct pattern you should use based on the problem that you are trying to solve.</p>\n    <br>\n    <p>Fortunately, we do have a few questions and methods that you can use that will tell you which design pattern you might want to apply to your specific needs.</p>\n    <br>\n    <p>First things first, you need to understand in theory what the pattern does and what problems it solves, for that, simply ask yourself this question: What is the nature of the problem?</p>\n    <br>\n    <p>Imagine that you need to create a system on which a library can manage and keep track of its books, allowing users to search for a specific book, check their availability, and borrow them.</p>.\n    <br>\n     <p>After some time, the number of books and users kept increasing, making the system slow and deprecated, where books are not always updated and there are many existing issues.</p>\n    <br>\n    <p>A more experienced developer will look at this situation and immediately realize that we might have a structural problem, taking into regard the inefficiencies and inaccuracies when it comes to the data stored and the user experience.</p>\n    <br>\n    <p>After some digging, you might say: “I need a design pattern that will enhance the data organization and optimize the user interactions with the platform, making the system, once again, efficient”.</p>\n    <br>\n    <p>After researching everything you could about the problem and its solutions, you might want to start looking for real-world uses of the same design pattern you want to use. To achieve this goal, search for software, systems, or applications where the same pattern is currently being used.</p>\n    <br>\n    <p>This will give a pretty good understanding of how the pattern works, allowing you to see it working in practice.</p>\n    <br>\n    <p>And just like on any construction, before starting to put rocks and bricks together we must first create a blueprint of the building that will help translate the project from paper to the real world.</p>\n    <br>\n    <p>With software or applications, it is the same thing, we need to create some kind of graphical representation of all the classes and objects involved in the project, and for that, you can simply use something like an Object Modeling Technique.</p>\n    <br>\n    <p>The main reason for doing this is that we establish a solid foundation of the project structure, allowing everyone who is working on the project to have clarity and understanding at every step of the way.</p>\n    <br>\n    <h3>Why & When Should You Learn Design Patterns</h3>\n    <br>\n    <p>Eventually, at some point, every developer will come across Design Patterns. This could be through a class, an online course, a blog post, or maybe heard somewhere.</p>\n    <br>\n    <p>So I hate to be that guy in the group who is always saying obvious things, but when creating your first tic-tac-toe app or weather app, you may not want to use any Design Patterns.<p>\n    <br>\n    <p>This would be like using a fire hose to extinguish a match. It is just too much.</p>\n    <br>\n    <p>But after you have built some simple projects and are starting to get some confidence to build something big, Design Patterns will be extremely valuable to you at this point because they will improve your skills as a developer.</p>\n    <br>\n    <p>The other reason why you should learn Design Patterns is because they will allow you to use the best practices when it comes to building projects and at the same thing you will be able to communicate complex ideas on an architectural level.</p>\n    <br>\n    <p>If you are not convinced yet that you should invest some time in learning Design Patterns, here are a few reasons to learn:</p>\n    <br>\n    <p>The first one worth mentioning is the code quality.</p>\n    <br>\n    <p>Have you ever looked at some function or any piece of code and thought: “Wow, the person who wrote this is pretty smart!”.</p>\n    <br>\n    <p>You get a similar feeling because Design Patterns will provide a set of tools and solutions for you to write a more organized and cleaner code. Making it easier to understand and scale easily over time, where you can add or remove features with no trouble.</p>\n    <br>\n    <p>Another reason you might consider is the actual knowledge that you get from knowing all this stuff.</p>\n    <br>\n    <p>Nine out of ten jobs will ask for, at least, a fundamental knowledge of Object-Oriented principles, and that includes knowing about inheritance, polymorphism, encapsulation, and abstraction.</p>\n    <br>\n    <p>Having a solid foundation in Design Patterns will also improve your communication skills.</p>\n    <br>\n    <p>Communication is one of the most important pillars of any realm of human knowledge, and coding is no different. You can add so much value to a project when you are familiar with Design Patterns, in other words, you can translate your ideas and thoughts in a way that everyone can understand, ensuring a well-structured codebase.</p>\n    <br>\n    <h3>Final Thoughts</h3>\n    <br>\n    <p>To finish this up, perhaps it is safe to say that Design Patterns shaped many areas of software development and the way we write and think about code.</p>\n    <br>\n    <p>At the end of the day, most people think that learning about Design Patterns is just about writing better code or impressing a coworker, but there is a much bigger reason for that, Design Patterns allow you to tackle complex problems and convert them into elegant solutions.</p>\n    <br>\n    <p>That's where the beauty lies, the light at the end of the tunnel, the amazing feeling of solving a problem. And, as we go deeper and deeper into the sea of software development we start to notice some islands that contain gold, in other words, ways that you can expand your skills and knowledge, and for the journey of mastering your skills of Design Patterns I highly recommend the book that brought this article to live.</p>\n    <br>\n    <p><a href='https://amzn.to/40EEFAb' target='_blank' rel='noreferrer' class='newpage-link'>Explore Design Patterns Book Here!</a></p>",
    "Description": "Some people say that you should learn Design Patterns to write better code while others say that you should learn to improve your communication. Those are all important factors to consider, but let me show you the real reason to learn Design Patterns.",
    "Title": "The Real Reason To Learn Design Patterns",
    "UUID": "6d842b8fc84b4b848ec969b0c9d0e1da",
    "created_at": "20240831 T20:13:13",
    "date": "August 31, 2024",
    "id": 3,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322238/article-images/pfpy4hvoxykjtgm64pjp.jpg",
    "tags": "computer science",
    "url_title": "the-real-reason-to-learn-design-patterns"
  },
  {
    "Content": "<p>Life is all about getting ready to face the challenges that life throws at us, and in order to do that we need to prepare, it does not matter if you are moving to another city or learning a new language, preparation is always necessary.</p>\n    <br>\n    <p>That's why I decided to write this article, to prepare those who want to learn about blockchain, web 3.0, and solidity.</p>\n    <br>\n    <p>As I mentioned, this article will not teach everything you need to know about these topics, but it will definitely prepare you for your journey of learning.</p>\n    <br>\n    <p>So let's dive straight into it.</p>\n    <br>\n    <h3>Blockchain</h3>\n    <br>\n    <p>Think of blockchain as a public, network-wide database. The 'block' stores data, often transaction records, and includes the current block's hash and the previous block's hash.</p>\n    <br>\n    <p>The 'chain' comes into play because each block contains the hash of the previous one. This chaining ensures data security and immutability across all connected devices.</p>\n    <br>\n    <h3>Blockchain Use Cases</h3>\n    <br>\n    <p>I think at some moment in school whether we were learning math or geography, we all thought of something like: “How is this important to my life?” or “Why should I care to learn about this?”.</p>\n    <br>\n    <p>So, today is your lucky day because I am going straight into the practical examples.</p>\n    <br>\n    <p>In a not-so-distant future, we might not need banks anymore, since the only reason for banks to exist is to ensure that our money will be safe, but we all know that this is not entirely true.</p>\n    <br>\n    <p>Right now, we only have Cryptocurrencies to achieve that, allowing users to send transactions to another side of the globe in only a few seconds. This alone is already huge, but imagine the scenario where we are able to control our currencies directly through the blockchain. I'm not talking about digital cash, I'm talking about real currencies that are not controlled by some bank or government.,</p>\n    <br>\n    <p>Another awesome use case for blockchain is for ownership and transparency, in the blockchain we can create DApps like reliable voting systems</p>\n    <br>\n    <p>I can also mention data security, privacy, and decentralization, in other words, software that is not controlled by some entity or company that can flip a switch and change the whole game for their own gain.</p>\n    <br>\n    <h3>Smart Contracts</h3>\n    <br>\n    <p>The term “Smart Contracts” can be a bit confusing, when we think about contracts in general we always imagine a lot of text on a piece of paper with a pen beside it.</p>\n    <br>\n    <p>Because of that, it's always a good practice to take notice of the differences, since they are not the same thing.</p>\n    <br>\n    <p>Smart Contracts are basically code that achieves some functionality or goal. This code can vary from transferring cryptocurrency to a voting software.</p>\n    <br>\n    <h3>Wallets</h3>\n    <br>\n    <p>Wallets on the other hand can be thought about the same way as normal wallets. Since wallets adopt the same concept as physical wallets, we can think of various differences.</p>\n    <br>\n    <p>Wallets are a way to access and interact with smart contracts, they can also be used to store cryptocurrencies or digital assets. Wallets are your whole identity on the blockchain.</p>\n    <br>\n    <h3>Functions</h3>\n    <br>\n    <p>Basically, functions are a block of code that gets the computer to “do something”, just like a verb, and like any other language, solidity has syntax for writing functions.</p>\n    <br>\n    <p>What's cool about Solidity is that we are able to declare different types of functions, let's take a look at some of them.</p>\n    <br>\n    <h3>View Functions</h3>\n    <br>\n    <p>Functions that are marked as ‘view’ will only read data, they will not be able to change variable values, call other functions, or perform any type of operation that does not involve reading data.</p>\n    <br>\n    <h3>Pure Functions</h3>\n    <br>\n    <p>These types of functions will not read or modify any state variable on the contract. They are only used for functions that operate based on the input values.</p>\n    <br>\n    <p>Imagine a function that adds two values, the return value only depends on the parameters.</p>\n    <br>\n    <h3>Function Visibility</h3>\n    <br>\n    <p>Still, on the functions topic, we can set visibility for our functions. That way we can make adjustments based on different situations.</p>\n    <br>\n    <h3>Private Functions</h3>\n    <br>\n    <p>These types of functions can only be called from inside the contract, meaning that only functions within the same contract can call private functions.</p>\n    <br>\n    <p>Imagine that we are developing a function that can level up our character in the game, for this case it is desirable to make this function private, we don't want people in our game calling the function every time, and the game would get tedious very quickly.</p>\n    <br>\n    <p>It is a good practice to set all your functions private. Also, for convention, private functions start with an underscore (_).</p>\n    <br>\n    <h3>Public Functions</h3>\n    <br>\n    <p>When a function is declared as public, it means that anyone or any contract can call it and execute its code.</p>\n    <br>\n    <p>Public functions are usually functions like checking your credit in some game, creating your character in the game, voting in a decentralized application, and transferring some tokens.</p>\n    <br>\n    <h3>External Functions</h3>\n    <br>\n    <p>External functions are somewhat similar to public functions, except that, as the name suggests, they can only be called from external sources.</p>\n    <br>\n    <p>And why would we want this?</p>\n    <br>\n    <p>External functions help the overall contract’s security and gas efficiency at the same time providing an explicit intent of the functionality of the code.</p>\n    <br>\n    <h3>Internal Functions</h3>\n    <br>\n    <p>Internal functions, as you might've guessed, can only be called from within the same contract.</p>\n    <br>\n    <p>Internal functions allow a more precise code, limiting and setting the contracts logic from a single contract.</p>\n    <br>\n    <h3>Modifiers</h3>\n    <br>\n    <p>Modifiers are just like functions, but with the keyword ‘modifier’.</p>\n    <br>\n    <p>We are able to attach modifiers to the end of functions to change the function's behavior. When we call the function with a modifier, the modifier's code gets executed first, then the code inside the actual function.</p>\n    <br>\n    <p>For example, we might have a modifier that ensures that only the contract owner can call specific functions.</p>\n    <br>\n    <h3>Memory Variables</h3>\n    <br>\n    <p>Declaring a variable with the ‘memory’ keyword is like using the RAM of the computer.</p>\n    <br>\n    <p>This means that the data will only be there temporarily, so after our code gets executed the whole thing gets deleted.</p>\n    <br>\n    <h3>Storage Variables</h3>\n    <br>\n    <p>Storage variables are the opposite, they will forever be stored on the blockchain.</p>\n    <br>\n    <p>This means two things, first: it costs more gas since we are technically storing data on the blockchain, and second: once our data gets written to the blockchain, it stays there forever, we cannot change or delete it.</p>\n    <br>\n    <h3>Events</h3>\n    <br>\n    <p>There is only one way for the blockchain to communicate with the outside world, through events.</p>\n    <br>\n    <p>Basically, every time a function gets called or some code gets executed, we might want to fire up an Event to warn our user interface that something happened.</p>\n    <br>\n    <p>A practical example would be having an event that fires up every time you send or receive some tokens.</p>\n    <br>\n    <h3>Mappings</h3>\n    <br>\n    <p>In the real world, a map provides visualization regarding your position on a given place. Having access to a map allows you to navigate from your current location to any desired destination.</p>\n    <br>\n    <p>Mappings in solidity are basically the same thing. They are a key-value pair used to store and look up data.</p>\n    <br>\n    <p>A good example would be a financial app where we can use a mapping to store the user's account number as the key and their current balance as the value.</p>\n    <br>\n    <h3>Inheritance</h3>\n    <br>\n    <p>If you are coming from other languages I bet you know what inheritance is, but for those who don't know I'm going to explain.</p>\n    <br>\n    <p>In Solidity, and many other languages, inheritance is a way to extend the capabilities of a contract. The cool thing about inheritance in solidity is that a contract can be inherited from multiple parent contracts.</p>\n    <br>\n    <h3>Gas</h3>\n    <br>\n    <p>You mean car gas, right?</p>\n    <br>\n    <p>Close, they have the same idea behind them.</p>\n    <br>\n    <p>On Ethereum, and many other blockchains, users have to pay a small fee in order to get their transaction complete.</p>\n    <br>\n    <p>Why is that necessary you might ask?</p>\n    <br>\n    <p>Validating a transaction is a complex problem and it requires a lot of computational work, meaning that, when a function gets executed, every single node on the blockchain runs the same function in order to validate the transaction.</p>\n    <br>\n    <p>That's what makes decentralization so powerful.</p>\n    <br>\n    <h3>Address</h3>\n    <br>\n    <p>Addresses are just like bank accounts, and we use them as a way of ownership.</p>\n    <br>\n    <p>This means that every address on the blockchain can send and receive transactions.</p>\n    <br>\n    <h3>Transactions</h3>\n    <br>\n    <p>We can think of transactions like basic money transactions, but the term is more used as an agreement between two parties, like the execution of a contract, on which the contract interacts with the ecosystem, or validating the information of a user on the blockchain.</p>\n    <br>\n    <h3>51% Attack</h3>\n    <br>\n    <p>By now you know that the blockchain is made up of nodes, and these nodes are just computers, servers, and other devices connected to the network.</p>\n    <br>\n    <p>That's where the 51% attack operates, to ‘hack’ the blockchain the attackers would have to take over 51% of the nodes on the blockchain, allowing them to reverse transactions, spend tokens, and fraud contracts, among other things.</p>\n    <br>\n    <p>But as the network grows with more users, it becomes increasingly difficult to perform a 51% attack, preventing a single entity from taking control of the nodes.</p>\n    <br>\n    <p>The cool thing is, the cost of conducting such an attack often outweighs the potential rewards, that's like using a $100 bill to buy a $50 bill, it's just not worth it.</p>\n    <br>\n    <h3>Wrapping Up</h3>\n    <br>\n    <p>The goal of this article was to provide you with all the concepts necessary to understand the many solidity and blockchain concepts.</p>\n    <br>\n    <p>Now with your current knowledge, you will be able to take your abilities in solidity to the next level by building real projects.</p>",
    "Description": "They say that life is all about facing challenges and to face challenges we need to be ready. Learn all the basics to get you going with web 3 technology.",
    "Title": "Everything You Need To Know About Web3",
    "UUID": "ae06c42d3bf64fbbbe6e197c9eba988e",
    "created_at": "20240824 T20:17:10",
    "date": "August 24, 2024",
    "id": 6,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322238/article-images/gyverd2uakt36dp9omop.jpg",
    "tags": "computer science",
    "url_title": "everything-you-need-to-know-about-web3"
  },
  {
    "Content": "<p>“Artificial Intelligence will be disruptive, but few people understand that education is going to be in the first frontline.”</p>\n    <br>\n    <p>Right now, there are two problems in education: what we teach and how we teach.</p>\n    <br>\n    <p>Artificial Intelligence, for some people, those words combined might induce fear, some sort of apocalyptic dystopia.</p>\n    <br>\n    <p>Perhaps it is because Artificial Intelligence has always been presented as a threat to human civilization.</p>\n    <br>\n    <p>We can just look at movies like Blade Runner, The Terminator, The Matrix, and A Space Odyssey.</p>\n    <br>\n    <p>What do all these movies have in common?</p>\n    <br>\n    <p>You are right! Some sort of advanced AI technology that becomes self-aware, and instantly represents a danger to the human race.</p>\n    <br>\n    <p>So as programmers and engineers, let's find out how this applies to education, what we can do to improve education and prevent potential</p>\n    <br>\n    <h3>Strong Implications For Better Or Worse</h3>\n    <br>\n    <p>Chat GPT, Siri, Alexa, facial recognition, speech recognition, predicting stocks, and medical diagnoses.</p>\n    <br>\n    <p>Those are all a few examples of AI being implemented in its full capacity for our current time.</p>\n    <br>\n    <p>But we need to clarify that we don't know what AI will look like in the future. Some people say that it will improve our lives and help humanity reach a crucial point in our evolution.</p>\n    <br>\n    <p>While other people say that it will turn against us and wipe out all human race.</p>\n    <br>\n    <p>Is it not wrong to say that we are pretty much a captain navigating on the ocean for the first time, we can't be sure if we are going to find a land full of gold or else…</p>\n    <br>\n    <p>With all that in mind, we must carefully ask the right questions when it comes to AI in education, like:</p>\n    <br>\n    <p>How exactly will AI work in classrooms? How will AI affect the role of teachers? What are the short-term and long-term impact on students?</p>\n    <br>\n    <p>Before we even consider answering these questions, we need to get technical and look at some possible implementations of Artificial Intelligence in education environments.</p>\n    <br>\n    <h3>Practical Examples Of AI In Education</h3>\n    <br>\n    <p>Let's say we create a machine learning model that can gather some data about students solving some mathematical problem, with this model we can start identifying underline misconceptions and struggles that each individual student faces.</p>\n    <br>\n    <p>This alone is huge, because teachers, researchers, educators will start to understand more about the process of learning and how learning can differ for each person.</p>\n    <br>\n    <p>But what will these learning tools look like you might ask?</p>\n    <br>\n    <p>For starters, one of the practical examples would be students having a one-to-one interaction with computers that provide some sort of personalized learning.</p>\n    <br>\n    <p>In the US, the average class size is 25, for just 1 teacher. It is fair to say that most of the time the students are not getting the necessary attention when it comes to learning.</p>\n    <br>\n    <p>So In this context the AI would offer personalized instructions for each student's needs.</p>\n    <br>\n    <p>Another problem that classrooms face is that the students have different learning paces.</p>\n    <br>\n    <p>Some students will find a mathematical problem easy to solve, while others might struggle to solve or not even solve at all.</p>\n    <br>\n    <p>How do we solve this problem?</p>\n    <br>\n    <p>One of the ways is to create adaptive learning systems that can dynamically adjust the learning material based on the students' performance.</p>\n    <br>\n    <p>This could help teachers identify sections where an individual is performing well and sections where the student struggles the most.</p>\n    <br>\n    <p>This alone would make an excellent impact on the student’s learning, since they would be tackling the areas where they are struggling and actually learning by doing hard things.</p>\n    <br>\n    <p>But again, we don't know the consequences of this, like, how we would make sure that students are on the same level?</p>\n    <br>\n    <p>And this raises another question: Do we need to keep students on the same level in a classroom?</p>\n    <br>\n    <p>For the students that are more advanced on some topic, it would be like running with some extra weight on their bodies.</p>\n    <br>\n    <p>Those so-called “tools” are often referred to as AIED (artificial intelligence in education) tools.</p>\n    <br>\n    <h3>It All Comes Full Cycle</h3>\n    <br>\n    <p>Would be cool if we could snap a finger and all of the world's classrooms have those kinds of tools, but we know that would be impossible and we also don't know the implications for that.</p>\n    <br>\n    <p>What we need is a gradual implementation of these technologies. For example, Social Media usage wasn't overnight, it took some years for people to start using it on a daily basis.</p>\n    <br>\n    <p>AI in education wouldn't be no different, especially AI in education.</p>\n    <br>\n    <p>As Machine Learning Engineers, we will need to make sure the systems and models are the best version they can be since we don't know the implications of these hypothetical tools.</p>\n    <br>\n    <p>We also don't know how this will affect students individually, why might work for some students more than others.</p>\n    <br>\n    <p>It is worth mentioning all sorts of social issues that AI might bring along, but we won't discuss them in this article, I will leave this for the experts in the subject.</p>\n    <br>\n    <p>Technology is evolving faster than the traditional education systems.</p>\n    <br>\n    <p>Today when students need to write an essay, they can just ask Chat GPT.</p>\n    <br>\n    <p>Why bother doing themselves when a “robot” can do a lot faster, even with poor quality. Who cares?</p>\n    <br>\n    <p>That's what happens when the educational system places more value on grades than in actual learning.</p>\n    <br>\n    <p>As a wise man once said: “I may be a madman, but I am a conscious madman”.</p>",
    "Description": "Artificial Intelligence in education. Do we actually need to worry and do something or it's all fun and games? Find out here.",
    "Title": "How Ai Will Transform Education",
    "UUID": "a55c8c06d42a4a15825a1940d9ae2d14",
    "created_at": "20240817 T20:21:51",
    "date": "August 17, 2024",
    "id": 10,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322237/article-images/jaqwsepcjuurdwwubuty.jpg",
    "tags": "computer science",
    "url_title": "how-ai-will-transform-education"
  },
  {
    "Content": "<p>“Clean code always looks like it was written by someone who cares. There is nothing obvious that you can do to make it better... And if you try to imagine improvements, you are sent back to the current code.”</p>\n    <br>\n    <p>— Michael Feathers</p><br>\n    \n    <p>There are hundreds of definitions for clean code. And all of them can be extremely different, but at the end of the day, they all are guided by the same ideas.</p>\n    <br>\n    <p>We can say that clean code is code that satisfies the reader, much like a good night's sleep, being efficient in its implementation. And above all, as mentioned by Michael Feathers, the code needs to be written by someone who cares about the process, someone who has dedicated their time to keeping the code simple, effective, and well-structured, with great attention to detail.</p>\n    <br>\n    <p>Similar to a good story, the writing of the code should expose tensions in the problem to be solved, these tensions should guide the person reading the code to a climax, as the problems are resolved.</p>\n    <br>\n    <p>With that in mind, in this article, we will comment on some rules you can follow if you are interested in writing code that sets you apart among other programmers.</p><br>\n    \n    <h3>Use meaningful names</h3><br>\n    \n    <p>In the world of programming, we use names for everything, whether it's naming files, folders, variables, functions, classes, and so on. And because of that, it's important to choose names that perfectly describe the purpose of the code.</p>\n    <br>\n    <p>Therefore, it's not a mistake to say that names should reflect the code's intention. Choosing a good name may take time, but it's a great long-term decision, potentially saving much more time.</p>\n    <br>\n    <p>The name you give to your function or variable should answer basic questions. For example, it should say what it does, why it exists, and what it's used for.</p><br>\n    \n    <h3>Be cautious with comments</h3><br>\n    \n    <p>A good comment goes beyond just explaining the code's implementation.</p>\n    <br>\n    <p>Yes, I know, writing comments helps you and others understand the purpose of the code. It's also valid to point out that programmers should have the discipline to write relevant and accurate comments.</p>\n    <br>\n    <p>However, some care is needed.</p>\n    <br>\n    <p>The primary purpose of comments is to compensate for the failure to express oneself well in code. Just like living beings evolve and change over time, the same happens with code.</p>\n    <br>\n    <p>When different people work on the same project, the code may be changed, and comments run the risk of not being updated or getting disconnected from the code.</p>\n    <br>\n    <p>Therefore, focus your attention on writing code that others can read and understand, at least to some extent, the code's intention.</p><br>\n    \n    <h3>Keep your code organized</h3><br>\n    \n    <p>When someone looks at disorganized and poorly structured code, they think that the final result of the code will be the same.</p>\n    <br>\n    <p>Because of this, you need to choose a set of rules that will ensure your code is well-formatted and apply them consistently. Especially if you're working with a group of people.</p>\n    <br>\n    <p>Having well-organized and structured code is synonymous with communication, and that's very important for programmers. Therefore, always use spaces and indentation where necessary, consider breaking your code into functions with a single purpose.</p>\n    <br>\n    <p>It's important to remember that a feature you create today is likely to change tomorrow, but good formatting and organization, those remain.</p><br>\n    \n    <h3>Test your code</h3><br>\n    \n    <p>How will you know that your code works as desired if you don't test it? The code you write for testing is as important as the code that goes into production.</p>\n    <br>\n    <p>Therefore, dedicating some of your time to writing test code is essential because when the source code changes, the test code also changes. And depending on the quality of the test code, it can be harder to fix in the long run, and the problem can become a snowball.</p>",
    "Description": "You know, there are things is life where you just have to accept and move on. Anyway check it out how you can write code like a human.",
    "Title": "Write Code Like A Human",
    "UUID": "cbcf2ba450094092b2da0bc2251cddef",
    "created_at": "20240810 T20:22:57",
    "date": "August 10, 2024",
    "id": 11,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322238/article-images/jtktsjabrw3b8jblbcgq.png",
    "tags": "computer science",
    "url_title": "write-code-like-a-human"
  },
  {
    "Content": "<p>Imagine you are living in the Paleolithic time, hanging out with your tribe, going from one place to another, seeking shelter, food, and other necessities.</p>\n    <br>\n    <p>All seems good, but all of a sudden a member of your tribe sees some colorful fruit and eats it, little did he know that the fruit is actually harmful, causing his death.</p>\n    <br>\n    <p>Tough stuff indeed.</p>\n    <br>\n    <p>Nobody knew that the fruit was poisonous, there was no Google back in that time, there was no teacher, and not even a book mentioning the fact that the fruit could kill you if you ingested it.</p>\n    <br>\n    <p>But what happens now? You might ask.</p>\n    <br>\n    <p>Now you and your tribe have documentation.</p>\n    <br>\n    <p>Wait what?</p>\n    <br>\n    <p>Yeah</p>\n    <br>\n    <p>But is not a documentation as you might have imagined, it is a different kind of documentation.</p>\n    <br>\n    <p>Is a documentation based on knowledge and experience, but still a documentation.</p>\n    <br>\n    <p>We can spot documentation throughout all of our history, since ancient times.</p>\n    <br>\n    <p>We document failures, successes, achievements, breakthroughs, discoveries, everything.</p>\n    <br>\n    <p>So let's see how you can use the power of documenting to level up your skills as a software engineer. </p>\n    <br>\n    <h3>The Basics</h3>\n    <br>\n    <p>Most of the time, we don't need to know every detail about some subject.</p>\n    <br>\n    <p>Like, you don’t need to know how a binary search algorithm works on a scientific level, you just simply need to know that it exists and know when you can implement it, depending on the scenario.</p>\n    <br>\n    <p>There is actually a term for that, it is called abstraction. You can check my full article on the topic.</p>\n    <br>\n    <p>When you are working on a new project the first step is always to refer to the documentation. Especially if you are contributing to Open Source projects.<p>\n    <br>\n    <p>Most of the time you cannot add value to a project if you do not understand the project, as I mentioned, you don't need to understand every little detail, just the necessary to get you going.</p>\n    <br>\n    <h3>Why bother documenting your projects</h3>\n    <br>\n    <p>So why not just build the thing and call it a day?</p>\n    <br>\n    <p>You can absolutely go down this way if you are building a small project, but for a large project, I'm talking enterprise-level thousands of accesses daily, trust me you will need documentation.</p>\n    <br>\n    <p>Documentation allows a person who has never heard of the project, to get some clarity on the project requirements and goals.</p>\n    <br>\n    <p>And, at the same time highlights the essential information about the project when it comes to actual code.</p>\n    <br>\n    <h3>The real reason to document your projects</h3>\n    <br>\n    <p>Documenting your projects is the same thing as constructing a building, you cannot just start putting bricks together without any planning.</p>\n    <br>\n    <p>It all comes down to effective communication.</p>\n    <br>\n    <p>Sometimes we might need to write some documentation regarding the logic of some piece of code, like why we did it this way instead of some other way.</p>\n    <br>\n    <p>Or what was the thought process behind the code? Was it an external factor or an internal one?</p>\n    <br>\n    <p>That's why documentation is important at the end of the day</p>\n    <br>\n    <p>It's about making other people understand the decision-making behind your code.</p>\n    <br>\n    <h3>Here is how to do it</h3>\n    <br>\n    <p>Here is a practical framework for documenting your projects, if you are just starting out on a new project, you don't need any kind of formal documentation.</p>\n    <br>\n    <p>Especially if it's a small project as I mentioned before.</p>\n    <br>\n    <p>Because let's be honest, over time the structure of your project will change, this might be the code that you write or the design pattern you use.</p>\n    <br>\n    <p>What this means is: that just start by using self-describing names for your variables and functions and some comments right and there to perhaps describe your thought process.</p>\n    <br>\n    <p>Self-describing names usually convey purpose or meaning. You also do not want to start throwing a bunch of comments in your code, because most of the time comments just make matters worse when it comes to understanding someone else's code.</p>\n    <br>\n    <p>Instead, what you want to do is place detailed comments on specific areas of your code that will guide a person reading it to understand the code.</p>\n    <br>\n    <p>Once you have all that in place, the structure of your code, the design pattern, the architecture, and the tech stack, you might wanna start a more formal documentation.</p>\n    <br>\n    <p>The reason for this is, that as the codebase gets bigger the harder it gets to find yourself there, especially for new people.</p>\n    <br>\n    <p>And as time goes on you are probably going to forget about the purpose of a function or why did you make such a decision. For that reason is nice to have documentation that not only explains the code on a technical level but also helps people reading it visualize the bigger picture.</p>\n    <br>\n    <h3>Where do I go from now?</h3>\n    <br>\n    <p>There is no barrier stopping you from writing documentation, as far as I know, you can even write docs on toilet paper, as long as people can access and read it.</p>\n    <br>\n    <p>Now that you know the importance of documentation and how it can level up your status as a project builder.</p>\n    <br>\n    <p>Let's go over some tools and resources that can be used to help you with that.</p>\n    <br>\n    <p><a href='https://github.com' target='_blank' rel='noreferrer' class='newpage-link'>GitHub</a>: This is an excellent way to host your documentation for your project. Given the fact that it offers built-in markdown code and it's so easy to share it with others.</p>\n    <br>\n    <p><a href='https://www.gitbook.com' target='_blank' rel='noreferrer' class='newpage-link'>GitBook</a>: This one is specific for hosting documentation. The best thing is that allows integrations with platforms like Google Analytics, Slack, and Jira. Great choice If you are a solo developer looking to scale your personal projects.</p>\n    <br>\n    <p><a href='https://readthedocs.org' target='_blank' rel='noreferrer' class='newpage-link'>Read the Docs</a>: With this one, you can build your documentation straight from the source code, and it will automatically deploy once you push the changes. You can start for free, and it also comes with various features. </p>\n    <br>\n    <p><a href='https://swagger.io' target='_blank' rel='noreferrer' class='newpage-link'>Swagger</a>: Trust me, if your application deals with APIs you will definitely want to use this. Besides providing a visual interface for your requests, Swagger will also write the documentation based on your API functionality.</p>\n    <br>\n    <p><a href='https://www.mkdocs.org' target='_blank' rel='noreferrer' class='newpage-link'>MkDocs</a>: This one is a no-brainer, simple to use, and it generates static pages for your markdown files. You can also customize it with themes and plugins to make it more appealing if you what I mean.</p>\n    <br>",
    "Description": "You might not realize this, but documentation is the foundation of programming when it comes to understanding someone's code.",
    "Title": "The Importance Of Documenting Your Projects",
    "UUID": "8c2573716bd44792b6bf6b51df45c782",
    "created_at": "20240803 T20:24:35",
    "date": "August 3, 2024",
    "id": 13,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322237/article-images/zn1igyenw5ggabixt3rf.png",
    "tags": "computer science",
    "url_title": "the-importance-of-documenting-your-projects"
  },
  {
    "Content": "<p>What makes a topic interesting? What dictates the hype? Can we know what is going to be the next big thing in our society?</p><br>\n    <p>These are some of the questions that I ask myself when everybody starts talking about something, whether it is an event, a new product, or in our case… AI.</p><br>\n    \n    <h3>what AI has achieved so far</h3><br>\n    \n    <p>Let's not waste any time here and talk about what AI has achieved so far.</p><br>\n    \n    <p>Autonomous cars</p><br>\n    <p>Ability to answer questions naturally</p><br>\n    <p>Digital assistants like Alexa and Siri</p><br>\n    <p>Image classification</p><br>\n    <p>Speech recognition</p><br>\n    \n    <p>So keep that in mind, dear reader, the field of AI has done a lot of stuff in the last few years. But why do we need to manage our expectations?</p><br>\n    \n    <h3>don't believe the short-term hype</h3><br>\n    \n    <p>Expectations are a funny thing, they can be considered a double-edged sword.</p><br>\n    \n    <p>On December 10th of 2020, a little game called Cyberpunk 2077 was released, saying it was going to break every record in the game industry.</p><br>\n    \n    <p>If you are familiar with this story then you know exactly what happened.</p><br>\n    \n    <p>The game had huge expectations around it, people were crazy to see all the revolutionary stuff that was being shown and said about the game.</p><br>\n    \n    <p>But when it hit the shelves, and people got to play it was full of problems and bugs, and people’s expectations for the game crashed bigger than the asteroid that killed the dinosaurs.</p><br>\n    \n    <p>That leads us to the new hype of Artificial Intelligence.</p><br>\n    \n    <p>Believed it or not, this is not the first time AI is being hyped to a point of such intensity.</p><br>\n    \n    <p>It all started in the 60s, with Symbolic AI.</p><br>\n    \n    <p>What is Symbolic AI you may ask?</p><br>\n    \n    <p>Back in the day, engineers believed that the key to creating intelligent systems was to hardcode a high number of rules within a system that eventually this system would become ‘intelligent’.</p><br>\n    \n    <p>All this stuff lead to a full wave of investments, followed by disappointments</p><br>\n    \n    <p>Because soon they noticed that all of this would not come true.</p><br>\n    \n    <p>So companies started to stop investing in research, marking the first AI winter.</p><br>\n    \n    <p>It took some years but finally, AI made its recovery.</p><br>\n    \n    <p>In the 80s, a new promise came along with an array of successes, and companies started to invest again.</p><br>\n    \n    <p>Oh no, they realized!</p><br>\n    \n    <p>Those systems were expensive to maintain, difficult to scale into something profitable, and there was no real-world value to that. You can guess what the companies did.</p><br>\n    \n    <p>But along came a method that would be known until this day, Machine Learning.</p><br>\n    \n    <p>With the rise of machines, lots of data being available in digital form, computers evolving faster than a Ferrari at 200 mph, and a big research community, the field arose from the ashes as people began to see the potential behind all of that.</p><br>\n    \n    <p>And today we can see all these factors combined in the form of autonomous cars, digital assistants, intelligent systems, and much more.</p><br>\n    \n    <p>But we have to ask ourselves a question: How far will this go?</p><br>\n    \n    <p>As I mentioned in the beginning, expectations are a funny thing when it comes to promises and optimism.</p><br>\n    \n    <p>Right now the world is seeing an intense form of optimism regarding AI, but what if we are not able to go further than this with the evolution of AI? What if we are in the corner of another AI winter?</p><br>\n    \n    <p>So, for the sake of all people in the world, it is best to moderate these expectations, making it crystal clear what AI can do and what AI cannot do.</p><br>\n    \n    <p>With that said, I might be wrong and in 5 years AI will take all of our jobs and rule society, I guess we will never know for sure.</p><br>\n    \n    <p>Enough of this, let's look at the bright side of AI, and how it can be used to solve a lot of problems that we face today in our lives.</p><br>\n    \n    \n    <h3>The Promise of AI</h3><br>\n    \n    <p>I think it is fair to say that the future of AI is looking pretty epic.</p><br>\n    \n    <p>Maybe we can consider some of the breakthroughs in AI equal to the discovery of penicillin.</p><br>\n    \n    <p>Back in the day, penicillin was crucial to saving millions of lives around the world, and it keeps saving until this day.</p><br>\n    \n    <p>I mean, perhaps we can say that AI is doing the same thing on a much smaller scale.</p><br>\n    \n    <p>Recently AI was used to identify a cancer cell in a patient's body, predict diseases, and also detect early signs of fatal diseases.</p><br>\n    \n    <p>Great stuff, indeed.</p><br>\n    \n    <p>Who knows how many lives this could save in the future?</p><br>\n    \n    <p>But it is fair to point out that most of this research stuff is not 100% being used in today's world.</p><br>\n    \n    <p>Your doctor doesn’t use AI, your gym doesn't use AI, and also your dentist doesn’t use AI.</p><br>\n    \n    <p>But one thing we know for sure is that the Ai is coming, we don’t know when and how but it’s coming.</p><br>\n    \n    <p>Today we can ask anyone on the street if they use smartphones and they probably will say yes. But get a time machine and go back 10 years, and start asking people the same question, I bet that you will find people that do not possess said technology.</p><br>\n    \n    <p>Same thing with social media, today everyone uses it.</p><br>\n    \n    <p>The point I am making is that stuff like this takes time to transition. Then, after that, people will start to see the potential of AI, the ability that AI has to transform the world we live in a fantastic way.</p><br>\n    \n    <p>To finish up, the best thing we can do right now is see the long-term vision, and not fall for the short-term hype.</p><br>",
    "Description": "Is AI really all that? Should we manage our expectations about AI? Find out about these important questions that are often overlooked regarding Artificial Intelligence",
    "Title": "Walking On Thin Ice With Ai",
    "UUID": "a5825b9ec26b4165b55dcbe4253c2293",
    "created_at": "20240727 T20:20:39",
    "date": "July 27, 2024",
    "id": 9,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322238/article-images/bs5racqtrpk1vs5dyy2k.jpg",
    "tags": "computer science",
    "url_title": "walking-on-thin-ice-with-ai"
  },
  {
    "Content": "<p>Have you ever received a text from someone and your mind can't make heads or tails about it.</p><br>\n    <p>Or when the doctor hands you a piece of paper that contains the prescription for your medication and the letter looks like arabic.</p><br>\n    <p>I’ve been there, you’ve been there, we all have been there.</p><br>\n    \n    <h3>The commit messages on github are the same thing when regarding communication and clarity.</h3><br>\n    \n    <p>If you check some of the commit messages you will see what I am talking about.</p><br>\n    \n    <p>Sometimes it is not enough to just write good code, you need to be able to express your code into human words.</p><br>\n    \n    <p>So put on a seatbelt, and let's look at how commit messages can affect you as a developer, as well as the code you are working on.</p><br>\n    \n    \n    <h3>why is it important</h3><br>\n    \n    <p>Communication is the foundation of the human race, without it we would be lost.</p><br>\n    \n    <p>Imagine that you are going to work on some big open-source project for the first time and then you see thousands of commit messages like “fix bugs”, “changes”, “update”.</p><br>\n    \n    <p>At this point you are simply lost in the woods my friend.</p><br>\n    \n    <p>You must first think about the people that will read your message.</p><br>\n    \n    <p>So you need to be precise when writing commit messages, avoiding room for interpretation.</p><br>\n    \n    <p>The people working on the project need to be on the same page when it comes to the programming world.</p><br>\n    \n    <p>Without collaboration and communication there is no way the project will evolve into something.</p><br>\n    \n    <p>Ask questions and you will have the answers</p><br>\n    \n    <p>Next time, when you write you commit message, think of these questions:</p><br>\n    \n    <p>What was the purpose of those changes?</p><br>\n    \n    <p>Why were the changes necessary in the first place?</p><br>\n    \n    <p>What problem is being addressed?</p><br>\n    \n    <p>After you answer these questions you will have the perfect commit message ready to go.</p><br>\n    \n    \n    <h3>the future will reward you</h3><br>\n    \n    <p>A good commit message can save hours when developing and debugging code.</p><br>\n    \n    <p>You can choose from those two commit messages below:</p><br>\n    \n    <p>git commit -m “Update styles”</p><br>\n    \n    <p>git commit -m “Adjust font size and padding header to improve the mobile responsiveness”</p><br>\n    \n    <p>Which one do you pick? I will give you one try…</p><br>\n    \n    <p>Given that, you must consider taking some time to really write a commit message that makes the people looking at your code understand why this change is being made, not just what is changing.</p><br>\n    \n    <p>Essentially, when you write a good commit message, you are making a deal with the future.</p><br>\n    \n    <p>Dedicating some time to come up with a solid commit message that will help you and the people working on the project.</p><br>\n    \n    \n    <h3>Some standard commit messages</h3><br>\n    \n    <p>The idea is to segment the different types of commit messages depending on the changes made.</p><br>\n    \n    <p>You can start you commit message with one of these words: feat, docs, fix, style, test, perf</p><br>\n    \n    <p>Feat - feat is used when you just implemented a new feature</p><br>\n    \n    <p>Docs - Documentation changes</p><br>\n    \n    <p>Fix - fix a bug or issue on the codebase</p><br>\n    \n    <p>Style - Changes related to the style, always good to be descriptive.</p><br>\n    \n    <p>Test - Adding new tests or updating old ones.</p><br>\n    \n    <p>Perf - Improve overall code performance, like refactoring or optimization</p><br>\n    \n    <p>Right off the bat we can see how prefixing our commit messages with a specific keyword can help us distinguish between multiple areas of development.</p><br>\n    \n    \n    <h3>You can use this</h3><br>\n    \n    <p>Of course it is worth mentioning that there is no universal rule when writing commit messages.</p><br>\n    \n    <p>Most of the time depends on the project that might have their own guidelines for commit messages.</p><br>\n    \n    <p>But there are always some conventional formats that you can start using.</p><br>\n    \n    <p>Like this one:</p><br>\n    \n    <p>&lt;type&gt; (&lt;scope&gt;): &lt;subject&gt;</p><br>\n    \n    <p>Type: Describes what area you are making the changes or adding stuff. Like mentioned above, some types include feat, docs, fix, and etc.</p><br>\n    \n    <p>Scope: This one is optional, but it doesn't hurt to have. The scope points to the part of code that is being changed, it can be a component, a file, an api, and so on.</p><br>\n    \n    <p>Subject: A concise description of the change. No need for long sentences, remember what I said earlier, take some time to really think of a good description that highlights the main objective of the message.</p><br>\n    \n    <p>Here is an example using this type of format:</p><br>\n    \n    <p>feat (authentication) : Add password reset functionality</p><br>\n    \n    <p>So next, before starting some project, whether it is only you working or a whole team, invest a time into the guidelines of the commit messages.</p><br>\n    \n    <p>Think of how the message will be written and what will be on the message.</p><br>\n    \n    <p>Later down the road when your project starts to scale, you will be glad that you made the effort into writing good commit messages.</p><br>\n    \n    <p>If by any case you want to learn more about this subject, consider visiting this official <a href='https://github.blog/2022-06-30-write-better-commits-build-better-projects/' target='_blank' class='newpage-link'><u>github page.</u></a></p><br>",
    "Description": "Is it really enough to just know how to code in today's world? Find out how commit messages can impact the dev world.",
    "Title": "Write Better Commit Messages",
    "UUID": "b4eb3607b76445278601a2251b680705",
    "created_at": "20240720 T20:19:10",
    "date": "July 20, 2024",
    "id": 8,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322238/article-images/nxd6tku0k5blqw7jyjur.jpg",
    "tags": "computer science",
    "url_title": "write-better-commit-messages"
  },
  {
    "Content": "<p>“The only way to learn new programming languages is by writing programs in it”</p>\n    <p>— Dennis Ritchie</p><br>\n    \n    <p>To get started learning programming you just need four things.</p>\n    <br>\n    <p>Know about variables, conditions, loops, and functions.</p>\n    <br>\n    <p>After that you just need to write code.</p><br>\n    \n    <p>You don't need a roadmap for programming, you do not need a book, or another tutorial.</p><br>\n    \n    <p>Back in the day when a friend of mine started on programming he watched a 10 hour video tutorial on JavaScript.</p>\n    <br>\n    <p>After he finished the tutorial he came to me and said: “I finished this tutorial then i went to open the code editor and couldn't write a single line of code”.</p>\n    <br>\n    <p>I immediately said to him: “exactly”.</p><br>\n    \n    <p>There is a term for that in the word of programming, it is called tutorial hell.</p>\n    <br>\n    <p>And it is the worst mistake that anyone starting in programming can make.</p><br>\n    \n    <p>In fact, most people do not realize that, so let me explain the process of tutorial hell.</p><br>\n    \n    <p>Imagine that you finished your 10 hours course on JavaScript, great stuff indeed, then you open a new vscode window, and just like my friend, you just cannot write code.</p><br>\n    \n    <p>Tutorial hell is simply that, not being able to code without some guidance.</p><br>\n    \n    <h3>How to escape</h3><br>\n    \n    <p>Just like Dante trying to escape the hell (or purgatory), you first will need to know the following:</p>\n    <br>\n    <p>Functions, variables, loops, and conditions.</p>\n    <br>\n    <p>Really the basics of programming. With just that you can build anything you imagine.</p><br>\n    \n    <p>But how would I do that you might ask?</p>\n    <br>\n    <p>Well, as they say, through trial and error.</p>\n    <br>\n    <p>After getting the four basics out of the way you might want to pick a stack that you are interested in.</p><br>\n    \n    <p>If you like front-end, pick HTML, CSS, JavaScript, and later down the road a framework.</p>\n    <br>\n    <p>On the other hand, if it is back-end you can choose Python, PHP, NodeJS, Rust, C#, and so on. You can also choose game development or mobile development, there are so many options available.</p><br>\n    \n    <h3>The cool part</h3><br>\n    \n    <p>Now comes the most awesome part about all of this, you will actually write code. Wow, imagine that.</p><br>\n    \n    <p>Select some project that catches your attention and try to create on your own, or replicate if it is from some tutorial.</p><br>\n    \n    <p>And when you get stuck building the project, believe me you will, just search the problem and go again.</p><br>\n    \n    <p>Perhaps you might need to read some documentation, or even watch a video dedicated to the problem you are facing. No shame in that, because it is you that is actually doing the heavy lifting.</p><br>\n    \n    <p>You are not just copying code from some tutorial.</p><br>\n    \n    <p>By doing that you will be able to test your problem solving skills, and learn from actually doing the thing.</p><br>\n    \n    <p>Programming has this false feeling of learning by watching others doing, but at the end of the day you are not really learning.</p><br>\n    \n    <p>You will never learn how to play some sport, by watching others playing. And, at the end of the day, programming is the same thing.</p>",
    "Description": "There are programmers out there who spend more time trying to find the perfect tutorial than actually writing code.",
    "Title": "Stop Studying Programming",
    "UUID": "83be220a30014e83a73bed0c20751b04",
    "created_at": "20240713 T20:18:06",
    "date": "July 13, 2024",
    "id": 7,
    "image_url": "https://res.cloudinary.com/djmr9rxjg/image/upload/v1704322238/article-images/dtrxdguvmzm2j1w1ho9n.jpg",
    "tags": "computer science",
    "url_title": "stop-studying-programming"
  }
]
